{
  "_id": "Fzzxozmuj4I",
  "as_of": "2021-12-13 02:31:21.482975",
  "video": {
    "title": "Google Made a Time Crystal That Defies Physics",
    "description": "Google's quantum computer has been used to create a time crystal, a newly defined phase of matter that defies the laws of scientific physics.\n» Recap on Quantum Supremacy https://www.youtube.com/watch?v=kyuf1zt-TpU \n» Subscribe to Seeker! http://bit.ly/subscribeseeker \n» Watch more Elements! http://bit.ly/ElementsPlaylist\n» Visit our shop at http://shop.seeker.com\n\nGoogle has been tinkering with one they’ve dubbed Sycamore and its biggest success to date was massively outperforming a conventional supercomputer, albeit in one task that was tailor-made to play to its strengths. Now, though, Google along with collaborating researchers have announced that they’ve used their quantum computer to create a newly defined phase of matter: a time crystal.\n\nYes you heard that right, according to a preprint paper by Google the company stated they’ve used their quantum computer to create time crystals. But before you go thinking I’m talking about some mystical sci-fi gemstone that allows its wielder to bend time to their whim, I should clarify what a time crystal is exactly. Ordinary crystals like diamonds have their atoms arranged in repeating patterns in space. In 2012, physicist and Nobel Laureate Frank Wilczek wondered if an object could exist with a crystal-like pattern but instead of that pattern repeating  physically, it repeated through time. Wilczek wondered if an object could change and then revert back to its original state, flipping back and forth in regular intervals indefinitely with no energy input. A phase of matter locked in a self-sustained cycle of change. It’s a cool idea but there’s a problem: a Wilczekian time crystal basically achieves perpetual motion and that is a fundamental no-no.\n\nWilczek wondered if an object could change and then revert back to its original state, flipping back and forth in regular intervals indefinitely with no energy input. A phase of matter locked in a self-sustained cycle of change. It’s a cool idea but there’s a problem: a Wilczekian time crystal basically achieves perpetual motion and that is a fundamental no-no. A 2014 proof showed that this iteration of a time crystal was impossible. But physicists couldn’t be deterred and so they expanded the definition of what a time crystal could be. A so-called Floquet time crystal would flip back and forth like a Wilczekian one, but only if it’s being driven by an external source. Physicists have simulated Floquet time crystals in computers, imagining a row of particles with spins that flip up and down periodically when hit with a laser beam. This time crystal needs the laser’s cycling light waves to flip, but it wouldn’t absorb any net energy from the laser to do so. \n\n#google #googlecrystal #quantumphysics #physics #science #seeker #space #technology #elements\n\nRead More: \n\nEternal Change for No Energy: A Time Crystal Finally Made Real\nhttps://www.quantamagazine.org/first-time-crystal-built-using-googles-quantum-computer-20210730/ \n\"Like a perpetual motion machine, a time crystal forever cycles between states without consuming energy. Physicists claim to have built this new phase of matter inside a quantum computer.\"\n\nWhat the heck is a time crystal, and why are physicists obsessed with them?\nhttps://www.popsci.com/science/what-is-time-crystal-physics/ \n\"In the last few years, physicists around the world have been constructing another state of matter: a “time crystal.” If that seems like B-movie technobabble, it’s technobabble no longer. Using a quantum computer, a few researchers have created a time crystal that, they think, firmly establishes time crystals in the world of physics.\"\n\nWorld’s first time crystals cooked up using new recipe\nhttps://www.newscientist.com/article/2119804-worlds-first-time-crystals-cooked-up-using-new-recipe/ \n\"Using Yao’s recipe as guidance, two groups have now created time crystals in the lab. Last September, a group headed by Chris Monroe of the University of Maryland in College Park built a time crystal out of a string of trapped ytterbium ions.\"\n____________________\n\nElements is more than just a science show. It’s your science-loving best friend, tasked with keeping you updated and interested in the compelling, innovative, and groundbreaking science that's happening all around us. Join our passionate hosts as they help break down and present fascinating science, from quarks to quantum theory and beyond.\n\nSeeker empowers the curious to understand the science shaping our world. We tell award-winning stories about the natural forces and groundbreaking innovations that impact our lives, our planet, and our universe. \n\nVisit the Seeker website https://www.seeker.com/videos \n\nElements on Facebook  https://www.facebook.com/SeekerElements/ \n\nSubscribe now! http://www.youtube.com/subscription_center?add_user=dnewschannel \n\nSeeker on Twitter http://twitter.com/seeker\n\nSeeker on Facebook https://www.facebook.com/SeekerMedia/ \n\nSeeker http://www.seeker.com/",
    "tags": [
      "seeker",
      "science",
      "curiosity",
      "education",
      "explain",
      "learn",
      "teach",
      "elements",
      "host",
      "explainer",
      "news",
      "science news",
      "current events",
      "edutainment",
      "inspiration",
      "google time crystal",
      "time crystals",
      "time crystal",
      "quantum physics",
      "physics",
      "quantum computing",
      "quantum computer",
      "tech news",
      "crystal",
      "symmetry",
      "quantum mechanics",
      "state of matter",
      "forms of matter",
      "time crystal google",
      "the action lab",
      "action lab",
      "astrophysics",
      "laws of physics",
      "defy the laws of physics",
      "laws of physics broken",
      "physics explained"
    ],
    "categories": [
      "Science & Technology"
    ],
    "channel_id": "UCzWQYUVCpZqtN93H8RR44Qw",
    "channel_title": "Seeker",
    "uploader": "Seeker",
    "uploader_id": "DNewsChannel",
    "upload_date": "2021-12-06 00:00:00",
    "duration_seconds": 256,
    "view_count": 241647,
    "like_count": 8294,
    "dislike_count": 0,
    "average_rating": 4.8509574,
    "files": {
      "video_filename": "Google Made a Time Crystal That Defies Physics-Fzzxozmuj4I.webm",
      "info_filename": "Google Made a Time Crystal That Defies Physics-Fzzxozmuj4I.info.json",
      "thumbnail_filename": "Google Made a Time Crystal That Defies Physics-Fzzxozmuj4I.webp"
    }
  }
}