{
  "_id": "osFuVmWHMoo",
  "as_of": "2021-12-12 14:07:45.012874",
  "video": {
    "title": "Meister Eckhart - Selected Verses and Teachings for Meditation (1) - Christian Mystics",
    "description": "Johannes Eckhart was one of the greatest of Christian mystics. He was born at Hochheim in Thüringen, Germany, in 1260 and died c.1327. He entered the Dominican order when he was 15. Later he became a distinguished professor and taught at different universities.\nHis direct and accessible teachings of a person's closeness to God inspired many people and he became well known throughout Europe. He was later summoned to an inquisition for heretical teachings, at which he vigorously defended himself.\n\nPlease note that my recordings can all be downloaded via my Google Drive, details of which can be found under the COMMUNITY tab.\n_______________________________________________\n\n🙏 May whatever goodness arises from these readings/offerings, may it be for the benefit of all sentient beings.\n\n🔆 If you would like to sponsor this channel and support the development of a small nun’s retreat hermitage:\n\n➤ PayPal: https://paypal.me/VivekaHermitage\n➤ Patreon: https://www.patreon.com/jayasara\n_______________________________________________\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized (and never will be) and the videos are strictly for educational purposes, not-for-profit and non-commercial.\n “All the videos, songs, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-05-01 00:00:00",
    "duration_seconds": 2300,
    "view_count": 66894,
    "like_count": 1437,
    "dislike_count": 0,
    "average_rating": 4.9022403,
    "files": {
      "video_filename": "Meister Eckhart - Selected Verses and Teachings for Meditation (1) - Christian Mystics-osFuVmWHMoo.webm",
      "info_filename": "Meister Eckhart - Selected Verses and Teachings for Meditation (1) - Christian Mystics-osFuVmWHMoo.info.json",
      "thumbnail_filename": "Meister Eckhart - Selected Verses and Teachings for Meditation (1) - Christian Mystics-osFuVmWHMoo.webp"
    }
  }
}