{
  "_id": "kFRdoYfZYUY",
  "as_of": "2021-12-13 04:04:10.392960",
  "video": {
    "title": "Hania Rani – Live from Studio S2",
    "description": "'Live from Studio S2' is out now, listen and buy here:\nhttps://idol.lnk.to/Live-from-Studio-S2\n\nThe full live set video was premiered on the evening before the annual Piano Day worldwide celebrations (March 29th). The motivation to make the recording of the live performances which became the release ‘Live from Studio S2’ came from the invitation from the Berlinale Film Festival. \n\n“I decided to rearrange some of my favourite songs, which I have been performing live for years. Recorded live and captured in the iconic Studio S2, one of the recording studios of Polish Radio in Warsaw. The hall is fully covered with light wood, which reminds me of other Radio Studios all around the world - like Funkhaus in Berlin for example. There is a kind of intimacy when playing the little piano in this huge and also very high venue.” — @Hania Rani\n\n“In the beginning of February 2021, I was asked to record a live set as a part of EFM sessions, which are the part of the Festival. I thought that bringing back my piano and equipment to the hall where I recorded my live session videos for my debut album 'Esja' would be a nice idea and the right cinematic choice. The iconic Studio S2 is one of the recording studios of Polish Radio in Warsaw. The hall is fully covered with light wood, which reminds me of other Radio Studios all around the world - like Funkhaus in Berlin. It felt very special to be in the hall where we recorded a video for \"Glass\", one of my most liked videoclips. There is a kind of intimacy when playing the little piano in this huge and also very high venue.”\n\nVideo: Mateusz Miszczyński\nSound recording: Agata Dankowska\nMixing: Piotr Wieczorek",
    "tags": [
      "Hania Rani",
      "Live from Studio S2",
      "Piano",
      "Live",
      "Warsaw",
      "Poland",
      "Piano Day"
    ],
    "categories": [
      "Music"
    ],
    "channel_id": "UCkpuDtzkZdavEqgXzLr9-Uw",
    "channel_title": "Gondwana Records",
    "uploader": "Gondwana Records",
    "uploader_id": "gondwanarecords",
    "upload_date": "2021-03-28 00:00:00",
    "duration_seconds": 1542,
    "view_count": 2969045,
    "like_count": 128922,
    "dislike_count": 0,
    "average_rating": 4.9583659,
    "files": {
      "video_filename": "Hania Rani – Live from Studio S2-kFRdoYfZYUY.webm",
      "info_filename": "Hania Rani – Live from Studio S2-kFRdoYfZYUY.info.json",
      "thumbnail_filename": "Hania Rani – Live from Studio S2-kFRdoYfZYUY.webp"
    }
  }
}