{
  "_id": "VRHvRr170sw",
  "as_of": "2021-12-12 23:20:42.987933",
  "video": {
    "title": "The Direct Instructions of Shri Singha to Padmasambhava (The Treasure of the Lotus Crystal Cave)",
    "description": "These profound meditation instructions were taught to Padmasambhava by his guru, Shri Singha. This chapter titled, \"The Treasure of the Lotus Crystal Cave\", first appeared in Crystal Cave: A compendium of teachings by masters of the practice lineage. Translated by Erik Pema Kunsang and edited by Ward Brisick. Rangjung Yeshe Publications, 1990. It is also found in the text, Treasures from Juniper Ridge:\nBook can be purchased here: https://tibetantreasures.com/products/treasures-from-juniper-ridge-t02073\n\nAccording to Erik Pema Kunsang, the original Tibetan text was found in a collection at the Royal Danish Library in 1976 by Dilgo Khyentse Rinpoche. \n\nThe full text of this reading can be found on Erik's FB page here where he has kindly made it available: https://www.facebook.com/notes/erik-pema-kunsang/the-treasure-of-the-lotus-crystal-cave/10159787848675550/\n\nMusic:  Shaman's Dream - selections from the albums: \"Kerala Dream\" and \"Prana Pulse\" \n_________________________________________\n\n🙏 May whatever goodness arises from these readings/offerings, may it be for the benefit of all sentient beings.\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________\n\n🔆 Thank you to everyone who has written to inquire about offering a donation to express appreciation for this channel.  If you would like to sponsor this channel and support the development of a Buddhist nun’s retreat hermitage that relies entirely on donations by offering dana you may:\n➤  PayPal: using the email address: vivekahermitage@gmail.com\n Or this link: https://paypal.me/VivekaHermitage \n\nAlternatively, if you prefer to make a bank deposit either internationally or domestically  (to avoid high Paypal fees) please contact us on the above email address for account details.\n_________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized for profit through YouTube advertising revenue, and never will be. All the videos are strictly for educational purposes, not-for-profit and non-commercial. If ads appear on some videos it is because the music companies have the “right” to run ads for their profit if I have used copyrighted music.\n “All the words, music, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-09-22 00:00:00",
    "duration_seconds": 3750,
    "view_count": 20417,
    "like_count": 580,
    "dislike_count": 0,
    "average_rating": 4.9189191,
    "files": {
      "video_filename": "The Direct Instructions of Shri Singha to Padmasambhava (The Treasure of the Lotus Crystal Cave)-VRHvRr170sw.webm",
      "info_filename": "The Direct Instructions of Shri Singha to Padmasambhava (The Treasure of the Lotus Crystal Cave)-VRHvRr170sw.info.json",
      "thumbnail_filename": "The Direct Instructions of Shri Singha to Padmasambhava (The Treasure of the Lotus Crystal Cave)-VRHvRr170sw.webp"
    }
  }
}