{
  "_id": "0296u91fsmo",
  "as_of": "2021-12-12 02:10:14.649842",
  "video": {
    "title": "Ibn' Arabi (1) - Alone with the Alone (and Selected Verses) - Sufi Mysticism - Poetry",
    "description": "Alone with the Alone by Ibn' Arabi - Translated by Henry Corbin plus selected verses of Ibn' Arabi.\n\n'Abū 'Abdullāh Muḥammad ibn 'Alī ibn Muḥammad ibn `Arabī al-Ḥātimī aṭ-Ṭāʾī (أبو عبد الله محمد ابن علي ابن محمد ابن عربي الحاتمي الطائي) was a Sufi mystic, poet, and philosopher born in Murcia, Spain on the 17th of Ramaḍān (26 July 1165 AD). He was one of the great mystics of all time. Through the richness of his personal experience and the constructive power of his intellect, he made a unique contribution to Shi'ite Sufism. He was considered a Saint.\nAfter his death, Ibn Arabi's teachings quickly spread throughout the Islamic world. His writings were not limited to the Muslim elites, but made their way into other ranks of society through the widespread reach of the Sufi orders. Arabi's work also popularly spread through works in Persian, Turkish, and Urdu.\n\nMusic:\nSecret Four - Tom Anousheh\nSecret Three - Tom Anousheh\n_______________________________________________\n\n🔆 If you would like to sponsor this channel and support the development of a small nun’s retreat hermitage:\n\n➤ PayPal: https://paypal.me/VivekaHermitage\n➤ Patreon: https://www.patreon.com/jayasara\n_______________________________________________\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized (and never will be) and the videos are strictly for educational purposes, not-for-profit and non-commercial.\n “All the videos, songs, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-06-10 00:00:00",
    "duration_seconds": 1130,
    "view_count": 35594,
    "like_count": 960,
    "dislike_count": 14,
    "average_rating": 4.9425054,
    "files": {
      "video_filename": "Ibn' Arabi (1) - Alone with the Alone (and Selected Verses) - Sufi Mysticism - Poetry-0296u91fsmo.webm",
      "info_filename": "Ibn' Arabi (1) - Alone with the Alone (and Selected Verses) - Sufi Mysticism - Poetry-0296u91fsmo.info.json",
      "thumbnail_filename": "Ibn' Arabi (1) - Alone with the Alone (and Selected Verses) - Sufi Mysticism - Poetry-0296u91fsmo.webp"
    }
  }
}