{
  "_id": "n_Zu992Q7JE",
  "as_of": "2021-12-12 10:06:56.921583",
  "video": {
    "title": "\"Wu Hsin\" (Part 5a) a.k.a. Roy Melvyn - Powerful Pointers to the Truth - Non-Duality",
    "description": "\"Wu Hsin\" (meaning No Mind)  was a fictitious character created by Roy Melvyn to create and structure a series of pith teachings and pointers to the Absolute, based on key non-duality teachings. Despite the controversy around the \"deceit\" in publishing these works as words from an  \"authentic\" Chinese Master, I have chosen to upload these readings as they are some of the clearest pointers I have read. Please be aware of the context as to how they were created. In essence, we are all really imaginary \"persons\" anyway!\n\nRoy Melvyn (1947-2017) was born in Brooklyn, New York. These pointers were taken from the book: \"Solving Yourself\". All of Melvyn's books can be purchased on Amazon.\n_________________________________________\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________\n\n🔆 Thank you to everyone who has written to inquire about offering a donation to express appreciation for this channel.  If you would like to sponsor this channel and support the development of a Buddhist nun’s retreat hermitage that relies entirely on donations by offering dana you may:\n➤  PayPal: using the email address: vivekahermitage@gmail.com\n Or this link: https://paypal.me/VivekaHermitage \n\nAlternatively, if you prefer to make a bank deposit either internationally or domestically  (to avoid high Paypal fees) please contact us on the above email address for account details.\n_________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized for profit through YouTube advertising revenue, and never will be. All the videos are strictly for educational purposes, not-for-profit and non-commercial. If ads appear on some videos it is because the music companies have the “right” to run ads for their profit if I have used copyrighted music.\n “All the words, music, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [
      "advaita",
      "wu hsin",
      "non-duality",
      "taosim"
    ],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-10-08 00:00:00",
    "duration_seconds": 1290,
    "view_count": 8627,
    "like_count": 206,
    "dislike_count": 0,
    "average_rating": 4.9052134,
    "files": {
      "video_filename": "'Wu Hsin' (Part 5a) a.k.a. Roy Melvyn - Powerful Pointers to the Truth - Non-Duality-n_Zu992Q7JE.webm",
      "info_filename": "'Wu Hsin' (Part 5a) a.k.a. Roy Melvyn - Powerful Pointers to the Truth - Non-Duality-n_Zu992Q7JE.info.json",
      "thumbnail_filename": "'Wu Hsin' (Part 5a) a.k.a. Roy Melvyn - Powerful Pointers to the Truth - Non-Duality-n_Zu992Q7JE.webp"
    }
  }
}