{
  "_id": "oIVAgdCZjNA",
  "as_of": "2021-12-13 01:45:56.874964",
  "video": {
    "title": "Machig Labdron - The Final Instructions - Mahamudra - Vajrayana Buddhism",
    "description": "Machig's Final Instructions - translated by Jerome Edou\n\nMachig Labdrön, or Singular Mother Torch from Lab\", 1055-1149 was a renowned 11th-century Tibetan tantric Buddhist practitioner, teacher and yogini who originated several Tibetan lineages of the Vajrayana practice of Chöd.\n\nIn the Life of Yeshe Tsogyel, Padmasambhava predicted that Yeshe Tsogyal would be reborn as Machig Labdrön, and her consort, Atsara Sale,[6] would become Topabhadra, Machig's husband. Her assistant and Padmasambhava's secondary consort, Tashi Khyidren, would be reborn as Machig's only daughter, and so on. All of the important figures in Tsogyel's life were to be reborn in the life of Machig Lapdron, including Padmasambhava himself, who would become Phadampa Sangye.\n_______________________________________________\n\n🙏 May whatever goodness arises from these readings/offerings, may it be for the benefit of all sentient beings.\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________________\n\n🔆 If you would like to sponsor this channel and support the development of a small nun’s retreat hermitage:\n➤  PayPal: https://paypal.me/VivekaHermitage\n➤  Patreon: https://www.patreon.com/jayasara\n_______________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized (and never will be) and the videos are strictly for educational purposes, not-for-profit and non-commercial.\n “All the videos, songs, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-05-31 00:00:00",
    "duration_seconds": 2090,
    "view_count": 21440,
    "like_count": 621,
    "dislike_count": 0,
    "average_rating": 4.9179811,
    "files": {
      "video_filename": "Machig Labdron - The Final Instructions - Mahamudra - Vajrayana Buddhism-oIVAgdCZjNA.webm",
      "info_filename": "Machig Labdron - The Final Instructions - Mahamudra - Vajrayana Buddhism-oIVAgdCZjNA.info.json",
      "thumbnail_filename": "Machig Labdron - The Final Instructions - Mahamudra - Vajrayana Buddhism-oIVAgdCZjNA.webp"
    }
  }
}