{
  "_id": "mfk--fvQ4oU",
  "as_of": "2021-12-12 09:30:26.311116",
  "video": {
    "title": "Mechthild of Magdeburg - Selected Verses - Christian Medieval Mystic",
    "description": "Selected verses from \"The Flowing light of the Godhead \" - Translated by Frank Tobin and the text \"Enduring Grace - Living Portraits of Seven Women Mystics  by Carol Lee Flinders\n\nMechthild of Magdeburg (c. 1207 – c. 1282/1294), a Beguine, was a Christian medieval mystic, whose book Das fließende Licht der Gottheit (The Flowing Light of Divinity) described her visions of God. She was the first mystic to write in German, as she did not know how to write in Latin. Definite biographical information about Mechthild is scarce; what is known of her life comes largely from scattered hints in her work. She was born in a noble Saxon family. She had her first vision of the Holy Spirit at the age of twelve. In 1230 she left her home and “renounced worldly honour and worldly riches” to become a Beguine at Magdeburg. \n\nHer criticism of church dignitaries, religious laxity and claims to theological insight aroused so much opposition that some called for the burning of her writings.\n\nMusic: Album - 1 Hour of Heavenly Choral Music from Renaissance & Baroque - https://www.youtube.com/watch?v=57BAevesxyI&t=873s\n_______________________________________________\n\n🔆 If you would like to sponsor this channel and support the development of a small nun’s retreat hermitage:\n\n➤ PayPal: https://paypal.me/VivekaHermitage\n➤ Patreon: https://www.patreon.com/jayasara\n_______________________________________________\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized (and never will be) and the videos are strictly for educational purposes, not-for-profit and non-commercial.\n “All the videos, songs, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-06-18 00:00:00",
    "duration_seconds": 930,
    "view_count": 4670,
    "like_count": 128,
    "dislike_count": 0,
    "average_rating": 4.9384613,
    "files": {
      "video_filename": "Mechthild of Magdeburg - Selected Verses - Christian Medieval Mystic-mfk--fvQ4oU.webm",
      "info_filename": "Mechthild of Magdeburg - Selected Verses - Christian Medieval Mystic-mfk--fvQ4oU.info.json",
      "thumbnail_filename": "Mechthild of Magdeburg - Selected Verses - Christian Medieval Mystic-mfk--fvQ4oU.webp"
    }
  }
}