{
  "_id": "q22fwf1wD-Y",
  "as_of": "2021-12-12 14:24:31.360775",
  "video": {
    "title": "Samaneri Jayasara - A Guided Meditation on Spaciousness",
    "description": "Dear Friends in the Dharma (and drama!),  greetings from retreat.\nHere is an impromptu guided meditation that I have recorded during my retreat. May it assist in a settling into and a recognising of your True Nature, the Beingness ... innate knowing ... natural Awareness...to help lead you to Ultimate Liberation.\n\nMusic: \"Lagoon\" by David Schombert\nPhoto by Caroline Nusadua\n _______________________________________________\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________________\n\n🔆 If you would like to sponsor this channel and support the development of a small nun’s retreat hermitage:\n➤  PayPal: https://paypal.me/VivekaHermitage\n➤  Patreon: https://www.patreon.com/jayasara\n\nIf you would like to download any of my recordings, please see this link to my Community tab - scroll to the bottom of the page: https://www.youtube.com/channel/UCz6X8QK9_JG49hJxnzAu-1w/community?view_as=subscriber _______________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized (and never will be) and the videos are strictly for educational purposes, not-for-profit and non-commercial.\n “All the videos, songs, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-07-27 00:00:00",
    "duration_seconds": 2340,
    "view_count": 21108,
    "like_count": 587,
    "dislike_count": 0,
    "average_rating": 4.9198666,
    "files": {
      "video_filename": "Samaneri Jayasara - A Guided Meditation on Spaciousness-q22fwf1wD-Y.webm",
      "info_filename": "Samaneri Jayasara - A Guided Meditation on Spaciousness-q22fwf1wD-Y.info.json",
      "thumbnail_filename": "Samaneri Jayasara - A Guided Meditation on Spaciousness-q22fwf1wD-Y.webp"
    }
  }
}