{
  "_id": "y-5Bs_RpFjI",
  "as_of": "2021-12-13 00:09:29.485643",
  "video": {
    "title": "Longchenpa - A Guided Meditation on Emptiness (Castles in the Clouds) - Dzogchen",
    "description": "An extract of Longchenpa's teaching focusing on the emptiness of all phenomena from the Trilogy of Rest.\n\"When appearances, vividly present to awareness, are not recognized for what they are, these same hallucinatory events seem true. But they are just like castles in the clouds. For within the state of awareness, they are simply the clear appearance of what does not exist. They are void of basis and intrinsic being, of ground and root. On the other hand, when they are recognized for what they are, they are simply seen as empty forms, for they have no substance. As the sūtra tells us, “All compounded things resemble castles in the clouds.” \n~ Longchenpa\n\nLongchenpa, also known as Longchen Rabjam ‘Infinite, Vast Expanse of Space’, or Drimé Özer (1308-1364), was one of the most brilliant teachers of the Nyingma lineage. He systematized the Nyingma teachings in his ‘Seven Treasures’ and wrote extensively on Dzogchen.    \n_________________________________________\n\n🙏 May whatever goodness arises from these readings/offerings be for the benefit of all sentient beings.\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________\n\n🔆 Thank you to everyone who has written to inquire about offering a donation to express appreciation for this channel. You are welcome to do so, and all offerings will go towards the development of a small retreat hermitage for nuns.\nThere are two options to donate using this email address: vivekahermitage@gmail.com  with PayPal and Transferwise (if you have your own accounts) \nor using this link: https://www.paypal.com/paypalme/VivekaHermitage\n\nAlternatively, if you prefer to make a bank deposit to Viveka Hermitage account, either internationally or domestically, please contact us on the above email address for account details.\n_________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized for profit through YouTube advertising revenue, and never will be. All the videos are strictly for educational purposes, not-for-profit and non-commercial. If ads appear on some videos it is because the music companies have the “right” to run ads for their profit if I have used copyrighted music. You can, however, easily install an ad blocker. Just Google it.\n “All the words, music, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.\"",
    "tags": [
      "dzogchen",
      "samaneri jayasara"
    ],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2021-03-15 00:00:00",
    "duration_seconds": 1980,
    "view_count": 12407,
    "like_count": 380,
    "dislike_count": 0,
    "average_rating": 4.9175258,
    "files": {
      "video_filename": "Longchenpa - A Guided Meditation on Emptiness (Castles in the Clouds) - Dzogchen-y-5Bs_RpFjI.webm",
      "info_filename": "Longchenpa - A Guided Meditation on Emptiness (Castles in the Clouds) - Dzogchen-y-5Bs_RpFjI.info.json",
      "thumbnail_filename": "Longchenpa - A Guided Meditation on Emptiness (Castles in the Clouds) - Dzogchen-y-5Bs_RpFjI.webp"
    }
  }
}