{
  "_id": "ds_FiMw5VF4",
  "as_of": "2021-12-12 07:29:14.107092",
  "video": {
    "title": "Joel Goldsmith - Selected excerpts from \"The Infinite Way\" -  Christian Mystics",
    "description": "Joel Solomon Goldsmith (March 10, 1892 – June 17, 1964) was an American spiritual author, teacher, spiritual healer, and modern-day mystic. He founded The Infinite Way movement. He was born in New York City on March 10, 1892.  His parents were non-practicing Jews, who were married in New York City in 1891. \n\nIn 1915, Joel's father became critically ill while in England and word was sent to the Goldsmith family to come for the body. However, according to Joel, his father was healed by a Christian Science practitioner in London. From his early adulthood, Joel Goldsmith had many spiritual experiences. Joel was a healer who spent many years in spiritual studies, reading original scriptures of Aramaic, Greek and Sanskrit origins. His first book, The Infinite Way, was published in 1948.\n\nMusic: Connecting Body, Mind and Soul - Body Mind Zone\n_________________________________________\n\n🙏 May whatever goodness arises from these readings/offerings, may it be for the benefit of all sentient beings.\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________\n\n🔆 Thank you to everyone who has written to inquire about offering a donation to express appreciation for this channel. You are welcome to do so, and all offerings will go towards the development of a small retreat hermitage for nuns.\nThere are two options to donate using this email address: vivekahermitage@gmail.com  with PayPal and Transferwise (if you have your own accounts) \nor using this link: https://paypal.me/VivekaHermitage \n\nAlternatively, if you prefer to make a bank deposit to Viveka Hermitage account, either internationally or domestically, please contact us on the above email address for account details.\n_________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized for profit through YouTube advertising revenue, and never will be. All the videos are strictly for educational purposes, not-for-profit and non-commercial. If ads appear on some videos it is because the music companies have the “right” to run ads for their profit if I have used copyrighted music. You can, however, easily install an ad blocker. Just Google it.\n “All the words, music, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-11-05 00:00:00",
    "duration_seconds": 1920,
    "view_count": 11680,
    "like_count": 307,
    "dislike_count": 0,
    "average_rating": 4.886076,
    "files": {
      "video_filename": "Joel Goldsmith - Selected excerpts from 'The Infinite Way' -  Christian Mystics-ds_FiMw5VF4.webm",
      "info_filename": "Joel Goldsmith - Selected excerpts from 'The Infinite Way' -  Christian Mystics-ds_FiMw5VF4.info.json",
      "thumbnail_filename": "Joel Goldsmith - Selected excerpts from 'The Infinite Way' -  Christian Mystics-ds_FiMw5VF4.webp"
    }
  }
}