{
  "_id": "-gY6ZtxkWFI",
  "as_of": "2021-12-12 09:52:52.012707",
  "video": {
    "title": "Dogen Zenji  - Shobogenzo - \"Truth Unfolding\" (Trans. Myers) - Zen Buddhism",
    "description": "An alternative translation (and a more poetic one I find) of the Genjo Koan - translated by Bob Myers as \"Truth Unfolding.\" The text/essay with commentary by Myers can be found here: https://terebess.hu/zen/dogen/FirstDogen.pdf\n\nGenjōkōan (現成公按) sometimes translated as Actualizing the Fundamental Point is an influential essay written by Dōgen, the founder of Zen Buddhism's Sōtō school in Japan. It is considered one of the most popular essays in Shōbōgenzō. Dōgen Zenji (19 January 1200 – 22 September 1253), also was a Japanese Buddhist priest, writer, poet, philosopher, and founder of the Sōtō school of Zen in Japan. \n\nMusic: Midori Takada - \"Through the Looking Glass\"\nTakashi Kokubo - \"Oasis of the Wind Forest\"\nSatashi Ashikawa - \"Still Space\"\n_______________________________________________\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________________\n\n🔆 If you would like to sponsor this channel and support the development of a small nun’s retreat hermitage:\n➤  PayPal: using the email address: vivekahermitage@gmail.com\n Or this link: https://paypal.me/VivekaHermitage \n➤  Patreon: https://www.patreon.com/jayasara\n_______________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized (and never will be) and the videos are strictly for educational purposes, not-for-profit and non-commercial.\n “All the words, music, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-08-20 00:00:00",
    "duration_seconds": 1680,
    "view_count": 8777,
    "like_count": 217,
    "dislike_count": 0,
    "average_rating": 4.9276018,
    "files": {
      "video_filename": "Dogen Zenji  - Shobogenzo - 'Truth Unfolding' (Trans. Myers) - Zen Buddhism--gY6ZtxkWFI.webm",
      "info_filename": "Dogen Zenji  - Shobogenzo - 'Truth Unfolding' (Trans. Myers) - Zen Buddhism--gY6ZtxkWFI.info.json",
      "thumbnail_filename": "Dogen Zenji  - Shobogenzo - 'Truth Unfolding' (Trans. Myers) - Zen Buddhism--gY6ZtxkWFI.webp"
    }
  }
}