{
  "_id": "5byB4_0anhQ",
  "as_of": "2021-12-12 04:17:27.581113",
  "video": {
    "title": "A Meditation Teaching on Emptiness - Nyoshul Khen Rinpoche - Dzogchen - Tibetan Buddhism",
    "description": "Profound pointers on emptiness for meditation taken from the text entitled: \"The Mirror of Essential Points\" - A letter in praise of Emptiness by Nyoshul Khen Rinpoche.\n\nNyoshul Khen Rinpoche (1932-1999) was a revered Tibetan meditation master, scholar, and poet, whose extraordinary presence and brilliant teaching style made a deep impact on the current generation of Tibetan lamas and on the transmission of Tibetan Buddhism to the West. A principal lineage holder in the Rime (nonsectarian) movement of Tibetan Buddhism, Nyoshul Khenpo counted twenty-five teachers from all of the Tibetan lineages as his masters. Foremost, he was an authority on the teachings of the Nyingma master Longchenpa and the Longchen Nyingthig, a cycle of teachings that focus on revealing the mind’s fundamental nature of luminous purity. \n\nText taken from \"Quintessential Dzogchen\" - edited by Erik Pema Kunsang and Marcia Binder Schmidt.\n\nMusic by: Ethereal Ephemera - Escape to Dreamscape\nWings Of An Angel - Farewell Darshan From The Madness Of Rationality And Materialism -  The Spiritual Origins Of Mind-Expanding Throat Singing\nC.paradisi - Sketches From The Edge Of Silence V.2 - 01 Winds Cease\nPlease find all these musicians and their creations at: www.bandcamp.com\n_________________________________________\n\n🙏 May whatever goodness arises from these readings/offerings be for the benefit of all sentient beings.\n\n❤️ A sincere thank you to all listeners and donors for your appreciative comments and offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________\n\n🔆 Thank you to everyone who has written to inquire about offering a donation to express appreciation for this channel. You are welcome to do so, and all offerings will go towards the development of a small retreat hermitage for nuns.\nThere are two options to donate using this email address: vivekahermitage@gmail.com  with PayPal,\nor using this link: https://www.paypal.com/paypalme/VivekaHermitage\nor become at Patron at: https://www.patreon.com/jayasara\n\nAlternatively, if you prefer to make a bank deposit (or use alternatives like Transferwise or Xoom) to Viveka Hermitage account, either internationally or domestically, please contact us on the above email address for account details.\n_________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized for profit through YouTube advertising revenue, and never will be. All the videos are strictly for educational purposes, not-for-profit and non-commercial. If ads appear on some videos it is because the music companies have the “right” to run ads for their profit if I have used copyrighted music.\n “All the words, music, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "Education"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2021-05-22 00:00:00",
    "duration_seconds": 2400,
    "view_count": 18091,
    "like_count": 575,
    "dislike_count": 0,
    "average_rating": 4.9383564,
    "files": {
      "video_filename": "A Meditation Teaching on Emptiness - Nyoshul Khen Rinpoche - Dzogchen - Tibetan Buddhism-5byB4_0anhQ.webm",
      "info_filename": "A Meditation Teaching on Emptiness - Nyoshul Khen Rinpoche - Dzogchen - Tibetan Buddhism-5byB4_0anhQ.info.json",
      "thumbnail_filename": "A Meditation Teaching on Emptiness - Nyoshul Khen Rinpoche - Dzogchen - Tibetan Buddhism-5byB4_0anhQ.webp"
    }
  }
}