{
  "_id": "AiuC_CaObbI",
  "as_of": "2021-12-10 14:37:54.246082",
  "video": {
    "title": "Samuel Barber - Agnus Dei [HD]",
    "description": "Please avoid posting comments about Samuel Barber's sexuality and enjoy the music! Any hateful comments will be removed.\n\nComposer: Samuel Barber (1910-1981)\nPerformed here by: The Dale Warland Singers \n_________________\n\nAbout this song:\n\nSamuel Barber rejected many arrangements, of Adagio for Strings, published by G. Schirmer, such as the organ arrangement by William Strickland. However he did transcribe the piece in 1967 for eight-part choir, as a setting of the Agnus Dei (\"Lamb of God\").\n\nAdagio for Strings (the string version of this piece) can be heard on many film, TV, and video game soundtracks, including Oliver Stone's Oscar-winning film \"Platoon\", David Lynch's 1980 Oscar-nominated film \"The Elephant Man\", Michael Moore's documentary \"Sicko\", \"Swimming Upstream\", \"Lorenzo's Oil\", \"A Very Natural Thing\", \"Reconstruction\", and Jean-Pierre Jeunet's Oscar-nominated 2001 film \"Amélie\". It has been heard in episodes of The Simpsons, Big Brother 2010 (UK), That Mitchell and Webb Look, The Boondocks, South Park, How I Met Your Mother, Seinfeld, ER (TV series), Red Dwarf, Big Love, and Mystery Science Theater 3000. A recorded performance by the London Symphony Orchestra was, for a time, the highest selling classical piece on iTunes. This choral version, Agnus Dei, can be heard in the soundtrack to the PC video game Homeworld (released in 1999, awarded with the Game of the Year accolade from the PC Gamer magazine). The work is extremely popular in the electronic dance music genre, notably in trance. Artists who have covered it include Armin van Buuren, William Orbit, Ferry Corsten, and Tiësto. eRa included this song in their new album Classics. Adagio is the final song on the final collaborative Peter, Paul and Mary album \"Peter Paul and Mary, With Symphony Orchestra\". Mary Travers had requested that Adagio be played at her memorial service. It was also played at the Royal Albert Concert Hall on the 15th September 2001 in memorial of the attacks on America that shook the world four days beforehand.\n\nAbout the photograph:\n\nSaint Paul's Cathedral, London, during the Blitz. This cathedral has survived despite being targeted during the Blitz - it was struck by bombs on 10 October 1940 and 17 April 1941. On 12 September 1940 a time-delayed bomb that had struck the cathedral was successfully defused and removed by a bomb disposal detachment of Royal Engineers under the command of Temporary Lieutenant Robert Davies. Had this bomb detonated, it would have totally destroyed the cathedral, as it left a 100-foot (30 m) crater when it was later remotely detonated in a secure location. As a result of this action, Davies was awarded the George Cross, along with Sapper George Cameron Wylie.\n\nOn 29 December 1940, the cathedral had another close call when an incendiary bomb became lodged in the lead shell of the dome but fell outwards onto the Stone Gallery and was put out before it could ignite the dome timbers. One of the most iconic images of London during the war was a photograph of St Paul's taken the same day by photographer Herbert Mason (in this video), from the roof of the Daily Mail in Tudor Street showing the cathedral shrouded in smoke.\n\nLisa Jardine of Queen Mary, University of London has written:\nWreathed in billowing smoke, amidst the chaos and destruction of war, the pale dome stands proud and glorious - indomitable. At the height of that air-raid, Sir Winston Churchill telephoned the Guildhall to insist that all fire-fighting resources be directed at St Paul's. The cathedral must be saved, he said, damage to the fabric would sap the morale of the country.\n\nFACEBOOK: http://www.facebook.com/TheJazzRoomMusic\nTWITTER: http://twitter.com/JazzRoomMusic\nYOUTUBE: http://www.youtube.com/TheJazzRoom",
    "tags": [
      "9/11",
      "11th",
      "September",
      "2001",
      "World",
      "Trade",
      "Center",
      "Samuel",
      "Barber",
      "Agnus",
      "Dei",
      "HD",
      "London",
      "the",
      "Blitz",
      "vocal",
      "tower",
      "music",
      "choir",
      "concert",
      "singing",
      "singers",
      "classical",
      "gospel",
      "building",
      "twin",
      "towers",
      "chorus",
      "choral",
      "harmony",
      "voices",
      "Saint",
      "Paul's",
      "Cathedral"
    ],
    "categories": [
      "Music"
    ],
    "channel_id": "UCX-cG2U7qtuU8jN2cpFM-gg",
    "channel_title": "Patrick Mac Cann",
    "uploader": "Patrick Mac Cann",
    "uploader_id": "TheJazzRoom",
    "upload_date": "2011-06-01 00:00:00",
    "duration_seconds": 520,
    "view_count": 11078469,
    "like_count": 109386,
    "dislike_count": 0,
    "average_rating": 4.9320607,
    "files": {
      "video_filename": "Samuel Barber - Agnus Dei [HD] [AiuC_CaObbI].webm",
      "info_filename": "Samuel Barber - Agnus Dei [HD] [AiuC_CaObbI].info.json",
      "thumbnail_filename": "Samuel Barber - Agnus Dei [HD] [AiuC_CaObbI].jpg"
    }
  }
}