{
  "_id": "yRH0Qcbt0yw",
  "as_of": "2021-12-13 00:13:04.596816",
  "video": {
    "title": "Ayu Khandro’s Heart-felt Advice - Dzogchen - Non-Duality",
    "description": "“The Record of the Heart-felt Advice of the Dakini, Indestructible Glorious Lamp” - by Ayu Khandro\nTranslated by James Low\n\nAyu Khandro (Long Life Dakini), also known as Dorje Paldrön, lived from 1839 to 1953 (114 years). She was a practitioner, yogini, and terton of Tibetan Buddhism in Eastern Tibet. An accomplished Dzogchen meditator, she is renowned for her extensive pilgrimages throughout Tibet, long periods of dark retreat practice, the gongter of the practice of the yidam Senge Dongma (the Lion-Faced Dakini), various forms of Chöd, and her lifelong dedication to spiritual practice.\nShe led the life of a hidden yogini, spending a significant amount of her life in retreat or as a wandering chodma. She was recognised as an emanation of Vajrayogini. \n\nArt work of Ayu Khankdro by Kay Kondrad -  https://dakiniasart.org/shop/ayu-khandro-art-print-kay-konrad/\nMusic: Mettaverse - Regenerative Spiritual Reset\n\n___________________________________________________\n🙏 May whatever goodness arises from these readings/offerings, may it be for the benefit of all sentient beings.\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________________\n\n🔆 If you would like to sponsor this channel and support the development of a small nun’s retreat hermitage:\n➤  PayPal: https://paypal.me/VivekaHermitage\n➤  Patreon: https://www.patreon.com/jayasara\n_______________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized (and never will be) and the videos are strictly for educational purposes, not-for-profit and non-commercial.\n “All the videos, songs, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-06-05 00:00:00",
    "duration_seconds": 1000,
    "view_count": 22208,
    "like_count": 654,
    "dislike_count": 0,
    "average_rating": 4.9397593,
    "files": {
      "video_filename": "Ayu Khandro’s Heart-felt Advice - Dzogchen - Non-Duality-yRH0Qcbt0yw.webm",
      "info_filename": "Ayu Khandro’s Heart-felt Advice - Dzogchen - Non-Duality-yRH0Qcbt0yw.info.json",
      "thumbnail_filename": "Ayu Khandro’s Heart-felt Advice - Dzogchen - Non-Duality-yRH0Qcbt0yw.webp"
    }
  }
}