{
  "_id": "MZgQsPdpYBc",
  "as_of": "2021-12-12 09:57:31.406748",
  "video": {
    "title": "H.H. Dudjom Rinpoche - A Dear Treasure for Destined Disciples -Dzogchen",
    "description": "Dudjom Yeshe Dorje  (1904-1987) — one of Tibet’s foremost yogins, scholars, and meditation masters.  Considered to be the living representative of Padmasambhava, he was a great revealer of the ‘treasures’ (terma) concealed by Padmasambhava. A prolific author and meticulous scholar, Dudjom Rinpoche wrote more than forty volumes, one of the best known of which is his monumental The Nyingma School of Tibetan Buddhism: Its Fundamentals and History. Over the last decade of his life he spent much time teaching in the West, where he helped to establish the Nyingma tradition, founding major centres in France and the United States. \n\nReading taken from the book - Quintessential Dzogchen: Confusion Dawns as Wisdom - translated by Erik Pema Kunsang and Marcia Binder Schmidt.\nBook can be purchased here: https://www.amazon.com.au/Quintessential-Dzogchen-Confusion-Dawns-Wisdom/dp/9627341584\n\nMusic credits: Blank Embrace - www.bandcamp.com\n_______________________________________________\n🙏 May whatever goodness arises from these readings/offerings, may it be for the benefit of all sentient beings.\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________________\n\n🔆 If you would like to sponsor this channel and support the development of a small nun’s retreat hermitage:\n➤  PayPal: https://paypal.me/VivekaHermitage\n➤  Patreon: https://www.patreon.com/jayasara\n_______________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized (and never will be) and the videos are strictly for educational purposes, not-for-profit and non-commercial.\n “All the videos, songs, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2019-06-22 00:00:00",
    "duration_seconds": 2200,
    "view_count": 19389,
    "like_count": 529,
    "dislike_count": 0,
    "average_rating": 4.9849339,
    "files": {
      "video_filename": "H.H. Dudjom Rinpoche - A Dear Treasure for Destined Disciples -Dzogchen-MZgQsPdpYBc.webm",
      "info_filename": "H.H. Dudjom Rinpoche - A Dear Treasure for Destined Disciples -Dzogchen-MZgQsPdpYBc.info.json",
      "thumbnail_filename": "H.H. Dudjom Rinpoche - A Dear Treasure for Destined Disciples -Dzogchen-MZgQsPdpYBc.webp"
    }
  }
}