{
  "_id": "4KGaOXenRNU",
  "as_of": "2021-12-12 05:20:06.643071",
  "video": {
    "title": "Longchen Rabjam -The Precious Treasury of the Way of Abiding - Part 4",
    "description": "The Precious Treasury of the Way of Abiding: Unity\n\nThis volume of Longchenpa's Seven Treasuries focuses on the four great samayas of Dzogchen: ineffability, openness, spontaneous presence, and oneness.\nTranslated by Richard Barron (Lama Chökyi Nyima)\nText can be purchased here: https://tibetantreasures.com/collections/precious-treasury-series/products/the-precious-treasury-of-the-way-of-abiding-boptowa?variant=7251479199807\n\nLongchenpa, also known as Longchen Rabjam ‘Infinite, Vast Expanse of Space’, or Drimé Özer (1308-1364), was one of the most brilliant teachers of the Nyingma lineage. He systematized the Nyingma teachings in his ‘Seven Treasures’ and wrote extensively on Dzogchen.\n\nMusic credits: Space Megalithe, Meditative Mind - www.bandcamp.com\n\n\nI do not own the rights to this text. This video is posted for educational and spiritual purposes only. Above content belongs to their respective owners. \n\nAll Music, Pictures, Videos and Sounds That Appear In This Video Are Owned By Their Respective Owners. \n\"Copyright Disclaimer, Under Section 107 of the Copyright Act 1976, allowance is made for 'fair use' for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"",
    "tags": [
      "dzogchen",
      "ati yoga"
    ],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2019-10-30 00:00:00",
    "duration_seconds": 3200,
    "view_count": 4291,
    "like_count": 113,
    "dislike_count": 0,
    "average_rating": 5.0,
    "files": {
      "video_filename": "Longchen Rabjam -The Precious Treasury of the Way of Abiding - Part 4-4KGaOXenRNU.webm",
      "info_filename": "Longchen Rabjam -The Precious Treasury of the Way of Abiding - Part 4-4KGaOXenRNU.info.json",
      "thumbnail_filename": "Longchen Rabjam -The Precious Treasury of the Way of Abiding - Part 4-4KGaOXenRNU.webp"
    }
  }
}