{
  "_id": "7b4yqWWK7ts",
  "as_of": "2021-12-12 05:34:43.700188",
  "video": {
    "title": "The Sufi's Sufi - Abol-Hasan of Kharaqan - Selected Verses for Meditation - Sufi Mystics",
    "description": "Sheik Abol-Hasan of Kharaqan is one of the master Sufis of Iran - considered a Sufi's Sufi.\nHe was born in 963 from Persian parents in Khorasan and died on the day of Ashura in 1033. He is not as well known or as widely as some of the great Muslim saints from Khorasan-Attar, Rumi, or Bahaoddin Naqhshband. However, this near anonymity was deliberate, according to the Sheikh's wish when he lived. Despite being a hidden saint, his spiritual affinity and grace are still very much acknowledged among the living Sufi circles across Iran and in the region. Even today, a steady stream of dervish pilgrims visits his tomb in Iran. His enduring presence is still potent among those whose aim in life is to attain higher knowledge and refinement of the heart. \n\nSelected Poems from the \"The Soul and a Loaf of Bread\" - Renditions by Vraje Abramian.\nThe book can be purchased here: https://www.amazon.com/Soul-Loaf-Bread-Teachings-Abol-Hasan-ebook/dp/B00QLH94XU\n\n Music:  Time for Peace - \"Sufi Prayer\"\nThis beautiful music can be purchased and downloaded here:   https://www.timeforpeace.bandcamp.com\nWith deepest thanks to Swami Madhuram Puri for his kind offering of this exquisite music for this channel.\n_________________________________________\n\n🙏 May whatever goodness arises from these readings/offerings, may it be for the benefit of all sentient beings.\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________\n\n🔆 Thank you to everyone who has written to inquire about offering a donation to express appreciation for this channel. You are welcome to do so, and all offerings will go towards the development of a small retreat hermitage for nuns.\nThere are two options to donate using this email address: vivekahermitage@gmail.com  with PayPal,\nor using this link: https://paypal.me/VivekaHermitage \n\nAlternatively, if you prefer to make a bank deposit (or use alternatives like Transferwise or Xoom) to Viveka Hermitage account, either internationally or domestically, please contact us on the above email address for account details.\n_________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized for profit through YouTube advertising revenue, and never will be. All the videos are strictly for educational purposes, not-for-profit and non-commercial. If ads appear on some videos it is because the music companies have the “right” to run ads for their profit if I have used copyrighted music.\n “All the words, music, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-11-18 00:00:00",
    "duration_seconds": 1700,
    "view_count": 20857,
    "like_count": 517,
    "dislike_count": 0,
    "average_rating": 4.9390478,
    "files": {
      "video_filename": "The Sufi's Sufi - Abol-Hasan of Kharaqan - Selected Verses for Meditation - Sufi Mystics-7b4yqWWK7ts.webm",
      "info_filename": "The Sufi's Sufi - Abol-Hasan of Kharaqan - Selected Verses for Meditation - Sufi Mystics-7b4yqWWK7ts.info.json",
      "thumbnail_filename": "The Sufi's Sufi - Abol-Hasan of Kharaqan - Selected Verses for Meditation - Sufi Mystics-7b4yqWWK7ts.webp"
    }
  }
}