{
  "_id": "vPA60_pVrJM",
  "as_of": "2021-12-12 23:20:20.974440",
  "video": {
    "title": "Longchen Rabjam (Longchenpa) Timeless Freedom - Part 1 - Dzogchen",
    "description": "Excerpt read from the chapter \"Timeless Freedom:  These  \"pointers\" from Longchenpa have been formatted for guided meditation purposes.   Taken from  the text  - A Treasure Trove of Scriptural Transmission - A Commentary on the Precious Treasury of the Basic Space of Phenomena.\n\nTranslated by Richard Barron.\nBook can be purchased here:\nhttps://tibetantreasures.com/products/a-treasure-trove-of-scriptural-transmission-boptob2?variant=7251478380607\n\nSuitable and intended for experienced meditators who have an in depth understanding and practical insight into Dzogchen's perfection. This is an amazingly clear and powerful teaching for recognising timeless awareness as the state of timeless freedom.\n\nMusic credits: Bing Satellites, Mirada, Norihito Suda - www.bandcamp.com\n_______________________________________________\n\n🔆 If you would like to sponsor this channel and support the development of a small nun’s retreat hermitage:\n\n➤ PayPal: https://paypal.me/VivekaHermitage\n➤ Patreon: https://www.patreon.com/jayasara\n_______________________________________________\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized (and never will be) and the videos are strictly for educational purposes, not-for-profit and non-commercial.\n “All the videos, songs, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2019-10-01 00:00:00",
    "duration_seconds": 3610,
    "view_count": 17067,
    "like_count": 386,
    "dislike_count": 0,
    "average_rating": 4.8503742,
    "files": {
      "video_filename": "Longchen Rabjam (Longchenpa) Timeless Freedom - Part 1 - Dzogchen-vPA60_pVrJM.webm",
      "info_filename": "Longchen Rabjam (Longchenpa) Timeless Freedom - Part 1 - Dzogchen-vPA60_pVrJM.info.json",
      "thumbnail_filename": "Longchen Rabjam (Longchenpa) Timeless Freedom - Part 1 - Dzogchen-vPA60_pVrJM.webp"
    }
  }
}