{
  "_id": "DqodJ6Rp2kA",
  "as_of": "2021-12-12 07:28:42.898907",
  "video": {
    "title": "Treasury of Natural Perfection - Part 1 - Longchen Rabjam - Dzogchen",
    "description": "Please note: these teachings are only suitable for those with a very good understanding, grasp, and deep respect for the perfection of the Master's teachings. Intended for deep meditation and contemplation.\n\nDzogchen, or the \"Great Perfection,\" is considered by many to be the apex of Tibetan Buddhism, and Longchen Rabjam is the most celebrated of all the saints of this remarkable tradition. Natural Perfection presents the radical precepts of Dzogchen, pointing the way to absolute liberation from conceptual fetters and leading the practitioner to a state of pure, natural integration into one's true being.\n\nReading taken by the text translated by  Keith Dowman. Book can be purchased here:\nhttps://www.amazon.com.au/Old-Man-Basking-Sun-Longchenpas/dp/9994664492\n\nMusic credits: Tonepoet, Mirada, Wings of an Angel - www.bandcamp.com\n_______________________________________________\n\n🔆 If you would like to sponsor this channel and support the development of a small nun’s retreat hermitage:\n\n➤ PayPal: https://paypal.me/VivekaHermitage\n➤ Patreon: https://www.patreon.com/jayasara\n_______________________________________________\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized (and never will be) and the videos are strictly for educational purposes, not-for-profit and non-commercial.\n “All the videos, songs, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [
      "dzogchen",
      "ati yoga",
      "tibetan buddhism"
    ],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2019-09-04 00:00:00",
    "duration_seconds": 5600,
    "view_count": 30652,
    "like_count": 597,
    "dislike_count": 0,
    "average_rating": 4.8955956,
    "files": {
      "video_filename": "Treasury of Natural Perfection - Part 1 - Longchen Rabjam - Dzogchen-DqodJ6Rp2kA.webm",
      "info_filename": "Treasury of Natural Perfection - Part 1 - Longchen Rabjam - Dzogchen-DqodJ6Rp2kA.info.json",
      "thumbnail_filename": "Treasury of Natural Perfection - Part 1 - Longchen Rabjam - Dzogchen-DqodJ6Rp2kA.webp"
    }
  }
}