{
  "_id": "BliETGxZgNY",
  "as_of": "2021-12-12 06:07:56.420683",
  "video": {
    "title": "Profound Instructions for Meditation Practice - Upasika Kee Nanayon  - Theravada Forest Tradition",
    "description": "Clear and direct teachings for meditation instructions taken from 3 key teachings from the text \"An Unentangled Knowing\" by Upasika Kee - translated by Thanissaro Bhikkhu.\nThe full  text can be downloaded here: https://www.holybooks.com/wp-content/uploads/An-Unentangled-Knowing-Lessons-in-Training-the-Mind.pdf\n\nUpasika Kee Nanayon or Kor Khao-suan-luang (1901-1978) was a realized female practitioner from Thailand. She was mostly self-taught, reading the Pali canon and other Buddhist literature. She considered the Buddha's Dhamma as her primary teacher. Her dhamma talks and poetry were widely circulated. As word of her spread, she became one of the most popular meditation teachers in Thailand. This, and many of her talks, have been translated into English by Thanissaro Bhikkhu who sees her as \"arguably the foremost woman Dhamma teacher in twentieth-century Thailand.\"\n_______________________________________________\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________________\n\n🔆 Thank you for your enquiries about offering a donation to express your appreciation for this channel.  If you would like to sponsor this channel and support the development of a Buddhist nun’s retreat hermitage that relies entirely on donations by offering dana you may:\n➤  PayPal: using the email address: vivekahermitage@gmail.com\n Or this link: https://paypal.me/VivekaHermitage \n\nAlternatively, if you can or wish to make a bank deposit either internationally or domestically  (to avoid high Paypal fees) please contact us on the above email address for account details.\n_______________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized for profit through YouTube advertising revenue, and never will be. All the videos are strictly for educational purposes, not-for-profit and non-commercial. If ads appear on some videos it is because the music companies have the “right” to run ads for their profit if I have used copyrighted music.\n “All the words, music, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-09-07 00:00:00",
    "duration_seconds": 1680,
    "view_count": 11426,
    "like_count": 344,
    "dislike_count": 0,
    "average_rating": 4.8870058,
    "files": {
      "video_filename": "Profound Instructions for Meditation Practice - Upasika Kee Nanayon  - Theravada Forest Tradition-BliETGxZgNY.webm",
      "info_filename": "Profound Instructions for Meditation Practice - Upasika Kee Nanayon  - Theravada Forest Tradition-BliETGxZgNY.info.json",
      "thumbnail_filename": "Profound Instructions for Meditation Practice - Upasika Kee Nanayon  - Theravada Forest Tradition-BliETGxZgNY.webp"
    }
  }
}