{
  "_id": "FaTz3ytQcy8",
  "as_of": "2021-12-12 07:39:40.952988",
  "video": {
    "title": "Samaneri Jayasara - A Guided Meditation on No~Thing in Particular",
    "description": "Following numerous requests for more original guided meditations, this one arose spontaneously.\n\n🙏 May whatever goodness arises from these readings/offerings, may it be for the benefit of all sentient beings.\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________\n\n🔆 Thank you to everyone who has written to inquire about offering a donation to express appreciation for this channel.  If you would like to sponsor this channel and support the development of a Buddhist nun’s retreat hermitage that relies entirely on donations by offering dana you may:\n➤  PayPal: using the email address: vivekahermitage@gmail.com\n Or this link: https://paypal.me/VivekaHermitage \n\nAlternatively, if you prefer to make a bank deposit either internationally or domestically  (to avoid high Paypal fees) please contact us on the above email address for account details.\n_________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized for profit through YouTube advertising revenue, and never will be. All the videos are strictly for educational purposes, not-for-profit and non-commercial. If ads appear on some videos it is because the music companies have the “right” to run ads for their profit if I have used copyrighted music.",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-10-12 00:00:00",
    "duration_seconds": 2570,
    "view_count": 12843,
    "like_count": 393,
    "dislike_count": 0,
    "average_rating": 4.9299998,
    "files": {
      "video_filename": "Samaneri Jayasara - A Guided Meditation on No~Thing in Particular-FaTz3ytQcy8.webm",
      "info_filename": "Samaneri Jayasara - A Guided Meditation on No~Thing in Particular-FaTz3ytQcy8.info.json",
      "thumbnail_filename": "Samaneri Jayasara - A Guided Meditation on No~Thing in Particular-FaTz3ytQcy8.webp"
    }
  }
}