{
  "_id": "Nr_wbGswbwI",
  "as_of": "2021-12-12 10:18:42.405959",
  "video": {
    "title": "Australian Aboriginal Spirituality - \"Dadirri\" - Inner Deep Listening and Quiet Still Awareness",
    "description": "Spiritual wisdom offered from the oldest living culture and people on this planet.\n\nI acknowledge the Traditional Owners of country throughout Australia and recognise their continuing connection to land, waters and culture. I pay my respect to their Elders past, present and emerging. 🙏 🖤💛❤️\n\n\"Dadirri\"  - means Inner Deep Listening and Quiet Still Awareness\nThe word, concept and spiritual practice that is dadirri (da-did-ee) is from the Ngan'gikurunggurr and Ngen'giwumirri languages of the Aboriginal peoples of the Daly River region (Northern Territory, Australia).\n\nA reflection by Miriam-Rose Ungunmerr.\nDr Miriam-Rose Ungunmerr (AO) is an Aboriginal elder from Nauiyu (Daly River), where she served for many years as the principal of the local Catholic primary school. She is a renowned artist, activist, writer and public speaker. \n\nMusic:  The Spirit of Uluru - by D.R. - Aboriginal Spiritual Music, Vol. II\nGeoffrey Gurrumul Yunupingu - Wiyathul\nPhoto: Finke River, South Australia - Ken Duncan\n\nFor further information on Dadirri and Aboriginal Culture please see:\n\nhttps://www.miriamrosefoundation.org.au/about-dadirri\nhttps://www.youtube.com/watch?v=tow2tR_ezL8\nhttps://www.youtube.com/watch?v=k2YMnmrmBg8&t=225s\n\n\nThis video is posted for educational and spiritual purposes only. Above content belongs to their respective owners. If copyrighted I won't object. \n\nAll Music, Pictures, Videos and Sounds That Appear In This Video Are Owned By Their Respective Owners. \n\n\"Copyright Disclaimer, Under Section 107 of the Copyright Act 1976, allowance is made for 'fair use' for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\"",
    "tags": [
      "australian aboriginal sprituality",
      "aboriginal religion",
      "aboriginal music"
    ],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-06-09 00:00:00",
    "duration_seconds": 2240,
    "view_count": 19180,
    "like_count": 585,
    "dislike_count": 0,
    "average_rating": 4.9527025,
    "files": {
      "video_filename": "Australian Aboriginal Spirituality - 'Dadirri' - Inner Deep Listening and Quiet Still Awareness-Nr_wbGswbwI.webm",
      "info_filename": "Australian Aboriginal Spirituality - 'Dadirri' - Inner Deep Listening and Quiet Still Awareness-Nr_wbGswbwI.info.json",
      "thumbnail_filename": "Australian Aboriginal Spirituality - 'Dadirri' - Inner Deep Listening and Quiet Still Awareness-Nr_wbGswbwI.webp"
    }
  }
}