{
  "_id": "zwkok8fMiII",
  "as_of": "2021-12-13 00:15:46.312195",
  "video": {
    "title": "Master Shiwu 石屋 - Stonehouse - Selected Poems for Meditation - Zen Buddhism (Chan)",
    "description": "The Zen master, Shiwu 石屋, or Stonehouse (1272–1352) was a Chinese Chan poet and hermit monk who lived during the Yuan Dynasty. He was considered one of the greatest Chinese Buddhist poets and used poetry as his medium of instruction for Dharma. \nIn 1312 at the age of forty he moved to Xiamu Mountain near Huzhou to live as a hermit and it is here that he composed his \"Mountain Poems\" (Shan-shih), one-hundred and eighty-four verses expounding Dharma and the facets of living in the mountains.\nNear the end of his life, monks asked him to record what he found of interest on his mountain; Stonehouse delivered to them hundreds of poems and an admonition: \"Do not try singing these poems. Only if you sit on them will they do you any good.\"\n\nTranslated by Red Pine (Bill Porter)\n\nMusic:  Time for Peace - \"Forest Meditation\" -   www.timeforpeace.bandcamp.com. \nWith deepest thanks to Swami Madhuram Puri for his kind offering of this exquisite music for this channel.\n_______________________________________________\n\n🙏 May whatever goodness arises from these readings/offerings be for the benefit of all sentient beings.\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________________\n\n🔆 Thank you for your enquiries about offering a donation to express your appreciation for this channel.  If you would like to sponsor this channel and support the development of a Buddhist nun’s retreat hermitage that relies entirely on donations by offering dana you may:\n➤  PayPal: using the email address: vivekahermitage@gmail.com\n Or this link: https://www.paypal.com/paypalme/VivekaHermitage\n_______________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized for profit through YouTube advertising revenue, and never will be. All the videos are strictly for educational purposes, not-for-profit and non-commercial. If ads appear on some videos it is because the music companies have the “right” to run ads for their profit if I have used copyrighted music.\n “All the words, music, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2021-03-05 00:00:00",
    "duration_seconds": 840,
    "view_count": 7924,
    "like_count": 258,
    "dislike_count": 0,
    "average_rating": 4.9845562,
    "files": {
      "video_filename": "Master Shiwu 石屋 - Stonehouse - Selected Poems for Meditation - Zen Buddhism (Chan)-zwkok8fMiII.webm",
      "info_filename": "Master Shiwu 石屋 - Stonehouse - Selected Poems for Meditation - Zen Buddhism (Chan)-zwkok8fMiII.info.json",
      "thumbnail_filename": "Master Shiwu 石屋 - Stonehouse - Selected Poems for Meditation - Zen Buddhism (Chan)-zwkok8fMiII.webp"
    }
  }
}