{
  "_id": "RZcmmWPzEAQ",
  "as_of": "2021-12-12 15:00:19.133922",
  "video": {
    "title": "The Zen Teaching of Huang Po (Part 1)  - On The Transmission of Mind",
    "description": "Excerpts read from the text - The Zen Teaching of Huang Po on the Transmission of Mind\nTranslated by John Blofeld.\n\nHuang-po (Huangbo Xiyun) was an influential Chinese Zen Master, and the teacher of Lin-chi (Rinzai) during the Tang Dynasty. Huángbò was a disciple of Baizhang Huaihai (720-840) There is not much information about the life of Huang Po. However he taught in the tradition of Zen Buddhism. Huang Po taught that enlightenment could be achieved by a silent mind and putting an end to conceptual thinking. This is a similar teaching to other Zen Masters such as Bodidharma and Dogen.\n\nMusic by Karunesh\nPlease note that all of my recordings can be downloaded via my Google Drive, details of which can be found under the COMMUNITY tab of the main page of my You Tube channel.\n_______________________________________________\n\n🔆 If you would like to sponsor this channel and support the development of a small nun’s retreat hermitage:\n\n➤ PayPal: https://paypal.me/VivekaHermitage\n➤ Patreon: https://www.patreon.com/jayasara\n_______________________________________________\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized (and never will be) and the videos are strictly for educational purposes, not-for-profit and non-commercial.\n “All the videos, songs, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-03-05 00:00:00",
    "duration_seconds": 2550,
    "view_count": 30217,
    "like_count": 738,
    "dislike_count": 0,
    "average_rating": 4.9359999,
    "files": {
      "video_filename": "The Zen Teaching of Huang Po (Part 1)  - On The Transmission of Mind-RZcmmWPzEAQ.webm",
      "info_filename": "The Zen Teaching of Huang Po (Part 1)  - On The Transmission of Mind-RZcmmWPzEAQ.info.json",
      "thumbnail_filename": "The Zen Teaching of Huang Po (Part 1)  - On The Transmission of Mind-RZcmmWPzEAQ.webp"
    }
  }
}