{
  "_id": "DSe6uG2v080",
  "as_of": "2021-12-12 06:29:56.782490",
  "video": {
    "title": "Mirabai (Meera) - Hindu Mystic - Poet Bhakti Movement",
    "description": "Mirabai (1502–1556) was a 16th-century Hindu mystic poet and devotee of Krishna. She is a celebrated Bhakti saint, particularly in the North Indian Hindu tradition.\nMirabai was  known for the incomparable beauty of the poems and bhajans she composed and sang in devotion to her beloved god, Krishna. Born in Rajasthan, she was married against her will to a prince of Chittor, near the fabled city of Udaipur. Her life was marred by persecution as she struggled to manifest her ardent desire to compose, sing and pursue spiritual studies. Though she was renowned for her talent, her family felt she was bringing dishonour by not behaving the way a courtly lady should — and they tried to poison and drown her.\n\nMusic:  Duduk Music - Earth is my Witness - Buddha's Lounge - https://www.youtube.com/watch?v=Fw_0lE0G3NA&t=30s\nEgyptian Music Duduk Meditation\n_______________________________________________\n\n🔆 If you would like to sponsor this channel and support the development of a small nun’s retreat hermitage:\n\n➤ PayPal: https://paypal.me/VivekaHermitage\n➤ Patreon: https://www.patreon.com/jayasara\n_______________________________________________\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized (and never will be) and the videos are strictly for educational purposes, not-for-profit and non-commercial.\n “All the videos, songs, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-05-06 00:00:00",
    "duration_seconds": 1920,
    "view_count": 17299,
    "like_count": 508,
    "dislike_count": 0,
    "average_rating": 4.9533076,
    "files": {
      "video_filename": "Mirabai (Meera) - Hindu Mystic - Poet Bhakti Movement-DSe6uG2v080.webm",
      "info_filename": "Mirabai (Meera) - Hindu Mystic - Poet Bhakti Movement-DSe6uG2v080.info.json",
      "thumbnail_filename": "Mirabai (Meera) - Hindu Mystic - Poet Bhakti Movement-DSe6uG2v080.webp"
    }
  }
}