{
  "_id": "Q7KeuBVAdYg",
  "as_of": "2021-12-12 14:25:18.554957",
  "video": {
    "title": "Free and Easy - A Spontaneous Vajra Song - Venerable Lama Gendun Rinpoche",
    "description": "Gendun Rinpoche was born in the Earth Horse year (1918) in the Kham region of eastern Tibet, in an area called Nangchen where the inhabitants are renowned for their bravery and honesty. Many of them traditionally devoted their lives to mystic asceticism and meditating in caves. Lama Gendun's birthplace is venerated as being the place where a legendary yogi called Sangye Yerpa was born in extraordinary circumstances.\n\nLama Gendun Rinpoche arrived in France in August 1975. From this date onwards he gave himself untiringly to the role entrusted to him by the Gyalwa Karmapa, that of transmitting the authentic Dharma to Westerners.\n\nHis activity took him to a great number of European countries. He passed away on the 31st October 1997 in his room at Dhagpo Kundreul Ling in the Auvergne.\n\nPeople have written to me to ask how they can make a donation. While these teachings are offered free of charge, people are welcome to contribute to a new endeavor to set up a small hermitage for myself and another Buddhist nun over the next year or two for the purpose of practicing in greater seclusion.\nDonations for this purpose would be received with gratitude and can be made via Pay Pal with this email address: vivekahermitage@gmail.com\n\nPlease note: all my recordings can be downloaded via my Google Drive page- please see details under the COMMUNITY tab of my You Tube channel",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-05-27 00:00:00",
    "duration_seconds": 540,
    "view_count": 7024,
    "like_count": 236,
    "dislike_count": 0,
    "average_rating": 4.949791,
    "files": {
      "video_filename": "Free and Easy - A Spontaneous Vajra Song - Venerable Lama Gendun Rinpoche-Q7KeuBVAdYg.webm",
      "info_filename": "Free and Easy - A Spontaneous Vajra Song - Venerable Lama Gendun Rinpoche-Q7KeuBVAdYg.info.json",
      "thumbnail_filename": "Free and Easy - A Spontaneous Vajra Song - Venerable Lama Gendun Rinpoche-Q7KeuBVAdYg.webp"
    }
  }
}