{
  "_id": "nVs13PUNyec",
  "as_of": "2021-12-12 10:20:25.876796",
  "video": {
    "title": "Mirabai (Meera) - Selected Poems for Meditation - Hindu Mystic - Poet Bhakti Movement",
    "description": "Mirabai (1502–1556) was a 16th-century Hindu mystic poet and devotee of Krishna. She is a celebrated Bhakti saint, particularly in the North Indian Hindu tradition.\nMirabai was  known for the incomparable beauty of the poems and bhajans she composed and sang in devotion to her beloved god, Krishna. Born in Rajasthan, she was married against her will to a prince of Chittor, near the fabled city of Udaipur. Her life was marred by persecution as she struggled to manifest her ardent desire to compose, sing and pursue spiritual studies. Though she was renowned for her talent, her family felt she was bringing dishonour by not behaving the way a courtly lady should — and they tried to poison and drown her.\n\nPoems taken from this website: https://www.poemhunter.com/mirabai/poems/\n\nArt image - \"Night's Dream\" by Dan Hillier used with kind permission of the artist.\nPlease see Dan's incredible art at: https://danhillier.com/\n\nMusic - Original music created by Jayasara using sample Indic sounds and doing weird things with programming!\n_________________________________________\n\n🙏 May whatever goodness arises from these readings/offerings be for the benefit of all sentient beings.\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________\n\n🔆 Thank you to everyone who has written to inquire about offering a donation to express appreciation for this channel. You are welcome to do so, and all offerings will go towards the development of a small retreat hermitage for nuns.\nThere are two options to donate using this email address: vivekahermitage@gmail.com  with PayPal and Transferwise (if you have your own accounts) \nor using this link: https://paypal.me/VivekaHermitage \n\nAlternatively, if you prefer to make a bank deposit to Viveka Hermitage account, either internationally or domestically, please contact us on the above email address for account details.\n_________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized for profit through YouTube advertising revenue, and never will be. All the videos are strictly for educational purposes, not-for-profit and non-commercial. If ads appear on some videos it is because the music companies have the “right” to run ads for their profit if I have used copyrighted music. You can, however, easily install an ad blocker. Just Google it.\n “All the words, music, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.\"",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2021-01-18 00:00:00",
    "duration_seconds": 1320,
    "view_count": 7891,
    "like_count": 289,
    "dislike_count": 0,
    "average_rating": 4.931973,
    "files": {
      "video_filename": "Mirabai (Meera) - Selected Poems for Meditation - Hindu Mystic - Poet Bhakti Movement-nVs13PUNyec.webm",
      "info_filename": "Mirabai (Meera) - Selected Poems for Meditation - Hindu Mystic - Poet Bhakti Movement-nVs13PUNyec.info.json",
      "thumbnail_filename": "Mirabai (Meera) - Selected Poems for Meditation - Hindu Mystic - Poet Bhakti Movement-nVs13PUNyec.webp"
    }
  }
}