{
  "_id": "5U8y3hv_p84",
  "as_of": "2021-12-12 05:33:33.901405",
  "video": {
    "title": "Thomas Merton - Learn to Be Alone - A Meditation/Contemplation on Solitude - Christian Mystics",
    "description": "Readings from selected chapters from the text \"Seeds of Contemplation\" by Thomas Merton. New Seeds of Contemplation is one of Thomas Merton's most widely read and best-loved books. Christians and non-Christians alike have joined in praising it as a notable successor in the meditative tradition of St. John of the Cross, The Cloud of Unknowing, and the medieval mystics, while others have compared Merton's reflections with those of Thoreau. \n\nMusic credits: \"Joy\" by Indiajiva\n\"Lagoon\" - David Schombert\n\"Deep Peace\" - Bill Douglas\n______________________________________________\n\n🙏 May whatever goodness arises from these readings/offerings be for the benefit of all sentient beings.\n\n❤️ A sincere thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________\n\n🔆 Thank you to everyone who has written to inquire about offering a donation to express appreciation for this channel. You are welcome to do so, and all offerings will go towards the development of a small retreat hermitage for nuns.\nThere are two options to donate using this email address: vivekahermitage@gmail.com  with PayPal and Transferwise (if you have your own accounts) \nor using this link: https://www.paypal.com/paypalme/VivekaHermitage\n\nAlternatively, if you prefer to make a bank deposit to Viveka Hermitage account, either internationally or domestically, please contact us on the above email address for account details.\n_________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized for profit through YouTube advertising revenue, and never will be. All the videos are strictly for educational purposes, not-for-profit and non-commercial. If ads appear on some videos it is because the music companies have the “right” to run ads for their profit if I have used copyrighted music. You can, however, easily install an ad blocker. Just Google it.\n “All the words, music, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.\"",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2021-02-16 00:00:00",
    "duration_seconds": 1750,
    "view_count": 16324,
    "like_count": 502,
    "dislike_count": 0,
    "average_rating": 4.9295497,
    "files": {
      "video_filename": "Thomas Merton - Learn to Be Alone - A Meditation_Contemplation on Solitude - Christian Mystics-5U8y3hv_p84.webm",
      "info_filename": "Thomas Merton - Learn to Be Alone - A Meditation_Contemplation on Solitude - Christian Mystics-5U8y3hv_p84.info.json",
      "thumbnail_filename": "Thomas Merton - Learn to Be Alone - A Meditation_Contemplation on Solitude - Christian Mystics-5U8y3hv_p84.webp"
    }
  }
}