{
  "_id": "ddi6CTtJu1A",
  "as_of": "2021-12-12 06:27:36.734289",
  "video": {
    "title": "Devikalottara - Ramana Maharshi - Advaita - Vedanta",
    "description": "DEVIKALOTTARAM:JNANACHARA VICHARA PADALAM (The Knowledge that Transcends Time Revealed to Devi).\nExpounded by the Supreme Lord Shiva to Devi Parvati. A beautiful, profound teaching that was recommended by Ramana and often read aloud by him.\n\nSri Ramana’s Introduction to Devikalottaram:\n\nThis  work  is  one  of  the upa-agamas  and  explains  the  supreme  wisdom  to  be attained  by  mature  souls and  their  mode  of  life  expounded  by  the  Supreme  Lord Siva to Devi  Parvati.   It is the essence of all agama sastras  on matters of spiritual knowledge.   This is verily  the  boat which can rescue  the  mortals struggling  hard, sinking  and  rising,  in  the  sorrowful  ocean  of  samsara  - the  endless cycle  of  birth and  death  -  and  take  them  by  the  direct  path  to  the  shore  of  liberation.    Let  all earnest seekers after Truth, instead of  groping  in  the dark, bewildered, and  losing their way, adopt the aid of this direct path and reach the supreme  state of bliss and peace.\n\nMusic: The Heart is Awake - Luminessence - Lydianna\nThe Heart is Awake - Luminessence - Distant Calling\nhttps://theheartisawake.bandcamp.com\n\nSingers of the Art of Living - Om Nama Shivaya\n_______________________________________________\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized (and never will be) and the videos are strictly for educational purposes, not-for-profit and non-commercial.\n “All the videos, songs, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [
      "advaita vedanta",
      "vedanta",
      "advaita",
      "closedcaptionsyoutube",
      "ccyoutube",
      "subtitlesyoutube",
      "ramana maharshi"
    ],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-07-03 00:00:00",
    "duration_seconds": 3599,
    "view_count": 26198,
    "like_count": 631,
    "dislike_count": 0,
    "average_rating": 4.8771119,
    "files": {
      "video_filename": "Devikalottara - Ramana Maharshi - Advaita - Vedanta-ddi6CTtJu1A.webm",
      "info_filename": "Devikalottara - Ramana Maharshi - Advaita - Vedanta-ddi6CTtJu1A.info.json",
      "thumbnail_filename": "Devikalottara - Ramana Maharshi - Advaita - Vedanta-ddi6CTtJu1A.webp"
    }
  }
}