{
  "_id": "pFU09M01SD8",
  "as_of": "2021-12-12 14:09:00.728868",
  "video": {
    "title": "Patrul Rinpoche - A Guided Meditation - Self-Liberating Meditation - Dzogchen",
    "description": "Dza Patrul Rinpoche  (1808-1887) — an enlightened master, who, though he lived the life of a vagabond, was one of the most illustrious spiritual teachers of the nineteenth century. His principal teacher was Jikmé Gyalwé Nyugu, a great master who was one of the foremost students of Jikmé Lingpa. \n\nThe full text of this reading can be found here: https://www.lotsawahouse.org/tibetan-masters/patrul-rinpoche/self-liberating-meditation\nTranslated by Adam Pearcey\n\nMusic credits: Blank Embrace, Bing Satellites, Mirada, Tonepoet - www.bandcamp.com\n_______________________________________________\n\n🙏 May whatever goodness arises from these readings/offerings, may it be for the benefit of all sentient beings.\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_____________________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized (and never will be) and the videos are strictly for educational purposes, not-for-profit and non-commercial.\n “All the words, music, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-08-14 00:00:00",
    "duration_seconds": 3300,
    "view_count": 57826,
    "like_count": 1228,
    "dislike_count": 0,
    "average_rating": 4.9201918,
    "files": {
      "video_filename": "Patrul Rinpoche - A Guided Meditation - Self-Liberating Meditation - Dzogchen-pFU09M01SD8.webm",
      "info_filename": "Patrul Rinpoche - A Guided Meditation - Self-Liberating Meditation - Dzogchen-pFU09M01SD8.info.json",
      "thumbnail_filename": "Patrul Rinpoche - A Guided Meditation - Self-Liberating Meditation - Dzogchen-pFU09M01SD8.webp"
    }
  }
}