{
  "_id": "rWEGOswggqA",
  "as_of": "2021-12-12 15:00:28.815015",
  "video": {
    "title": "St Catherine (of Siena) - Selected Poems and Verses for Meditation - Christian Mystics",
    "description": "Catherine of Siena (25 March 1347 – 29 April 1380), a lay member of the Dominican Order, was a mystic, activist, and author who had a great influence on Italian literature and the Catholic Church. Canonized in 1461, she is also a Doctor of the Church.\n\nShe was born and raised in Siena, and at an early age wanted to devote herself to God, against the will of her parents. Despite Catherine's religious nature, she did not choose to enter a convent and instead she joined the Third Order of St. Dominic, which allowed her to associate with a religious society while living at home. Fellow Dominican sisters taught St. Catherine how to read. Meanwhile, she lived quietly, isolated within her family home.\n\nSt. Catherine developed a habit of giving things away and she continually gave away her family's food and clothing to people in need. She never asked permission to give these things away, and she quietly put up with their criticisms. She made herself known very quickly by being marked by mystical phenomena such as invisible stigmata and a mystical marriage.\n\nMusic: Anders Holte - 'Full Moon'\nAlberto Rivera - 'Angel's Song'\n_______________________________________________\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized (and never will be) and the videos are strictly for educational purposes, not-for-profit and non-commercial.\n “All the words, music, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-08-22 00:00:00",
    "duration_seconds": 750,
    "view_count": 6686,
    "like_count": 210,
    "dislike_count": 0,
    "average_rating": 4.9810429,
    "files": {
      "video_filename": "St Catherine (of Siena) - Selected Poems and Verses for Meditation - Christian Mystics-rWEGOswggqA.webm",
      "info_filename": "St Catherine (of Siena) - Selected Poems and Verses for Meditation - Christian Mystics-rWEGOswggqA.info.json",
      "thumbnail_filename": "St Catherine (of Siena) - Selected Poems and Verses for Meditation - Christian Mystics-rWEGOswggqA.webp"
    }
  }
}