{
  "_id": "PPhmXHD7eGo",
  "as_of": "2021-12-12 14:16:47.638966",
  "video": {
    "title": "Chapter 26 Ribhu Gita - plus Ramana Maharshi's Six Key Verses - Advaita Vedanta",
    "description": "One  of  Bhagavan  Ramana's  favourite  traditional  spiritual  works  was  the  Ribhu  Gita. The Ribhu Gita forms the sixth section of the Sanskrit work known as Siva Rahasya. It is the teachings of  Lord  Siva  in  Mount  Kailas to His devotee Ribhu, from whom  the Gita derives its name.\nBhagavan  Ramana's  often  referred  to  the  Ribhu  Gita  in  his  talks  with  devotees  and seekers,  and  he  is  reported  to  have  said  that if  one  repeatedly  read  Chapter  26  of  the Ribhu  Gita  one  could  pass  spontaneously  into  Samadhi,  or  the  natural  state  of  Self-realization.\n_______________________________________________\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized (and never will be) and the videos are strictly for educational purposes, not-for-profit and non-commercial.\n “All the videos, songs, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [
      "ramana maharhsi",
      "vedanta",
      "advaita"
    ],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-06-06 00:00:00",
    "duration_seconds": 3020,
    "view_count": 26303,
    "like_count": 568,
    "dislike_count": 0,
    "average_rating": 4.9444447,
    "files": {
      "video_filename": "Chapter 26 Ribhu Gita - plus Ramana Maharshi's Six Key Verses - Advaita Vedanta-PPhmXHD7eGo.webm",
      "info_filename": "Chapter 26 Ribhu Gita - plus Ramana Maharshi's Six Key Verses - Advaita Vedanta-PPhmXHD7eGo.info.json",
      "thumbnail_filename": "Chapter 26 Ribhu Gita - plus Ramana Maharshi's Six Key Verses - Advaita Vedanta-PPhmXHD7eGo.webp"
    }
  }
}