{
  "_id": "TctQz8arBlc",
  "as_of": "2021-12-12 19:52:41.309181",
  "video": {
    "title": "Kahlil Gibran (2)  \"The Beauty of Death\"  - Mystical/Spiritual Poetry",
    "description": "Reading of one of Gibran's famous poems, \"The Beauty of Death.\" \nLebanon-born writer and artist Kahlil Gibran  (1883–1931) became known for his mystical Arabic and English works, most notably the 1923 publication, 'The Prophet.' Kahlil Gibran moved to the United States in 1895 and was exposed to Boston's artistic community. Initially showing promise as an artist, he also began writing newspaper columns and books in Arabic, drawing attention for his prose poems. After moving to New York City, Gibran began writing books in English. The popularity of The Prophet endured well after the author's death in 1931, making him the third-best-selling poet of all time.\n\nMusic:  Time for Peace - One -Part 2.\nThis beautiful music can be purchased and downloaded here:  www.timeforpeace.bandcamp.com. \nWith deepest thanks to Swami Madhuram Puri for his kind offering of this exquisite music for this channel.\n_________________________________________\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________\n\n🔆 Thank you to everyone who has written to inquire about offering a donation to express appreciation for this channel. You are welcome to do so, and all offerings will go towards the development of a small retreat hermitage for nuns.\nThere are two options to donate using this email address: vivekahermitage@gmail.com  with PayPal and Transferwise (if you have your own accounts) \nor using this link: https://paypal.me/VivekaHermitage \n\nAlternatively, if you prefer to make a bank deposit to Viveka Hermitage account, either internationally or domestically, please contact us on the above email address for account details.\n_________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized for profit through YouTube advertising revenue, and never will be. All the videos are strictly for educational purposes, not-for-profit and non-commercial. If ads appear on some videos it is because the music companies have the “right” to run ads for their profit if I have used copyrighted music. You can, however, easily install an ad blocker. Just Google it.\n “All the words, music, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.",
    "tags": [
      "kahlil gibran"
    ],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-10-30 00:00:00",
    "duration_seconds": 1200,
    "view_count": 10994,
    "like_count": 290,
    "dislike_count": 0,
    "average_rating": 4.905724,
    "files": {
      "video_filename": "Kahlil Gibran (2)  'The Beauty of Death'  - Mystical_Spiritual Poetry-TctQz8arBlc.webm",
      "info_filename": "Kahlil Gibran (2)  'The Beauty of Death'  - Mystical_Spiritual Poetry-TctQz8arBlc.info.json",
      "thumbnail_filename": "Kahlil Gibran (2)  'The Beauty of Death'  - Mystical_Spiritual Poetry-TctQz8arBlc.webp"
    }
  }
}