{
  "_id": "lIOQL7SOAuA",
  "as_of": "2021-12-12 08:12:56.309453",
  "video": {
    "title": "Hafiz (1)  Selected Verses for Meditation  - Sufi Mystics",
    "description": "Persian lyric poet Hafiz (born Khwāja Šamsu d-Dīn Muḥammad Hāfez-e Šīrāzī) grew up in Shiraz. Very little is known about his life, but it is thought that he may have memorized the Qur’an after hearing his father recite passages. When his father died, he left school to work at a bakery and as a copyist. Hafiz became a poet at the court of Abu Ishak and also taught at a religious college. He is one of the most celebrated of the Persian poets, and his influence can be felt to this day. As the author of numerous ghazals expressing love, spirituality, and protest, he and his work continue to be important to Iranians, and many of his poems are used as proverbs or sayings.\n\nMusic credits: Duduk Meditation Music - Yeghshe Manukyan\nIllustration/graphic: The ceiling from the Tomb of Hafiz\n_____________________________________________\n\n🔆 If you would like to sponsor this channel and support the development of a small nun’s retreat hermitage:\n\n➤ PayPal: https://paypal.me/VivekaHermitage\n➤ Patreon: https://www.patreon.com/jayasara\n_______________________________________________\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized (and never will be) and the videos are strictly for educational purposes, not-for-profit and non-commercial.\n “All the videos, songs, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-06-14 00:00:00",
    "duration_seconds": 1202,
    "view_count": 40980,
    "like_count": 1096,
    "dislike_count": 0,
    "average_rating": 4.9495497,
    "files": {
      "video_filename": "Hafiz (1)  Selected Verses for Meditation  - Sufi Mystics-lIOQL7SOAuA.webm",
      "info_filename": "Hafiz (1)  Selected Verses for Meditation  - Sufi Mystics-lIOQL7SOAuA.info.json",
      "thumbnail_filename": "Hafiz (1)  Selected Verses for Meditation  - Sufi Mystics-lIOQL7SOAuA.webp"
    }
  }
}