{
  "_id": "fYFRycF2TTg",
  "as_of": "2021-12-12 07:42:40.388861",
  "video": {
    "title": "Longchenpa - Finding Rest in Illusion - Chapter 6 - That is Like an Echo - Dzogchen",
    "description": "Chapter 6 - The Chapter That is Like a Echo - from the text \"Finding Rest in Illusion: The Trilogy of Rest\", Volume 3 by Longchenpa, translated by Padmakara Translation Group © 2018 by the Padmakara Translation Group. Produced in arrangement with Shambhala Publications, Inc. Boulder, CO.\nThe book can be purchased here: https://www.shambhala.com/finding-rest-in-illusion-15548.html\n\nTibetan master Longchenpa’s famous work that systematically presents the path of yogic conduct according to the Dzogchen tradition.\n\nLongchen Rabjam (1308-1363), is a great luminary of Tibetan Buddhism. He was highly skilled in all aspects of scholarship from an early age and excelled throughout his life in the practice and accomplishment of the Dharma. Regarded as a great Dzogchen master, Longchenpa had many pure visions where he was given direct instructions from Guru Padmasambhava  and is recognised as an emanation of Vimalamitra. Longchenpa's prolific writings have made him one of Tibet's most renowned and precious teachers.\n_______________________________________________\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________________\n\n🔆 If you would like to sponsor this channel and support the development of a small nun’s retreat hermitage:\n➤  PayPal: using the email address: vivekahermitage@gmail.com\n Or this link: https://paypal.me/VivekaHermitage \n➤  Patreon: https://www.patreon.com/jayasara\n_______________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized (and never will be) and the videos are strictly for educational purposes, not-for-profit and non-commercial.\n “All the words, music, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-08-10 00:00:00",
    "duration_seconds": 1670,
    "view_count": 9169,
    "like_count": 238,
    "dislike_count": 0,
    "average_rating": 4.9666667,
    "files": {
      "video_filename": "Longchenpa - Finding Rest in Illusion - Chapter 6 - That is Like an Echo - Dzogchen-fYFRycF2TTg.webm",
      "info_filename": "Longchenpa - Finding Rest in Illusion - Chapter 6 - That is Like an Echo - Dzogchen-fYFRycF2TTg.info.json",
      "thumbnail_filename": "Longchenpa - Finding Rest in Illusion - Chapter 6 - That is Like an Echo - Dzogchen-fYFRycF2TTg.webp"
    }
  }
}