{
  "_id": "OEfg9ZOMXiI",
  "as_of": "2021-12-12 13:29:24.856259",
  "video": {
    "title": "A Guided Meditation on Freedom from Thoughts - Samaneri Jayasara",
    "description": "This is a guided meditation to help us work skillfully with thoughts, to understand their essence, and to be liberated from excessive, neurotic, and obsessive thinking.\n\n🙏 May whatever goodness arises from these readings/offerings be for the benefit of all sentient beings.\n\n🔆 Thank you to everyone who has written to inquire about offering a donation to express appreciation for this channel. You are welcome to do so, and all offerings will go towards supporting requisites and overheads at a Buddhist nun's hermitage.\nThere are two options to donate using this email address: vivekahermitage@gmail.com  \nwith PayPal,\nor using this link: https://www.paypal.com/paypalme/VivekaHermitage\nor become at Patron at: https://www.patreon.com/jayasara\n\nAlternatively, if you prefer an alternative, such as bank transfer, Transferwise or Xoom please contact us on the above email address for account details.\n_________________________________________\n\n❤️ A sincere thank you to all listeners and donors for your appreciative comments and offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized for profit through YouTube advertising revenue, and never will be. All the videos are strictly for educational purposes, not-for-profit and non-commercial. If ads appear on some videos it is because the music companies have the “right” to run ads for their profit if I have used copyrighted music.\n “All the words, music, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2021-08-11 00:00:00",
    "duration_seconds": 4233,
    "view_count": 17726,
    "like_count": 548,
    "dislike_count": 6,
    "average_rating": 4.9566789,
    "files": {
      "video_filename": "A Guided Meditation on Freedom from Thoughts - Samaneri Jayasara-OEfg9ZOMXiI.webm",
      "info_filename": "A Guided Meditation on Freedom from Thoughts - Samaneri Jayasara-OEfg9ZOMXiI.info.json",
      "thumbnail_filename": "A Guided Meditation on Freedom from Thoughts - Samaneri Jayasara-OEfg9ZOMXiI.webp"
    }
  }
}