{
  "_id": "BPgpRpU13yI",
  "as_of": "2021-12-12 14:14:28.185952",
  "video": {
    "title": "The final 3 hours of UNUS ANNUS (with live chat) READ DESCRIPTION",
    "description": "To all the people who commented \"TAKE THIS DOWN.\" I will let it be taken down by YouTube, or Mark and Ethan can DM me on twitter (@fetamean) however, for all the people who didn't get to see the 12 hour stream on the 13th, I wanted to give you part of the chance.\n\nI will not be reuploading any other Unus Annus material because this is the only stuff I have.\nIf Mark and Ethan take this down, that's totally fine with me, but I know there's a lot of fans out there that didn't get to see the final moments of Unus Annus, and I don't think the final five minutes would do it justice.\n\nIf Mark or Ethan, or Amy, or any of the Unus Annus team is really bitter about me uploading this, I apologize profusely. DM me on twitter @fetamean and I will remove it.\n\n\nAs a fan of Unus Annus, I knew it would be wrong to archive the rest of the channel's videos, but there was so much philosophy and motivating speech here that it almost blew the channel out of the water. This will go down in YouTube history as one of the most influential concepts to grace the internet.\n\n\nI think people will have archived the episodes they wanted to watch. I think that was part of the motivation for fans in the beginning. I'm sure countless of them saved every video to have their personal collection to watch on their computer. I think uploading all the episodes now would be a bit of a disservice to them, but we'll see how they feel down the line.\n\n\nI feel bittersweet about uploading this right now, but I wanted to give everyone who had work, or homework, or school, or was asleep, or was in the hospital, or was having a mental breakdown the chance to see Unus Annus out. If it is not removed by November 13th, 2021, I will remove it myself.\n\nThanks for reading.\n\n@markiplier\n@crankgameplays",
    "tags": [
      "unus",
      "annus",
      "unus annus",
      "markiplier",
      "crankgameplays",
      "unus annus stream"
    ],
    "categories": [
      "Entertainment"
    ],
    "channel_id": "UCJ1EjXj7qjfaYubRBZNx7jQ",
    "channel_title": "Mean Cheese Fetamean",
    "uploader": "Mean Cheese Fetamean",
    "uploader_id": "GnarbroTaKa",
    "upload_date": "2020-11-14 00:00:00",
    "duration_seconds": 11903,
    "view_count": 120801,
    "like_count": 6312,
    "dislike_count": 0,
    "average_rating": 4.2171254,
    "files": {
      "video_filename": "The final 3 hours of UNUS ANNUS (with live chat) READ DESCRIPTION-BPgpRpU13yI.webm",
      "info_filename": "The final 3 hours of UNUS ANNUS (with live chat) READ DESCRIPTION-BPgpRpU13yI.info.json",
      "thumbnail_filename": "The final 3 hours of UNUS ANNUS (with live chat) READ DESCRIPTION-BPgpRpU13yI.webp"
    }
  }
}