{
  "_id": "NkleDncfsV0",
  "as_of": "2021-12-12 10:17:25.703460",
  "video": {
    "title": "Ashtavakra Gita - Part 4 - Ramana Maharshi - Advaita",
    "description": "Ashtavakra Gita is one of the advaitic masterpieces.  One of Sri Ramana Maharshi's most beloved texts. Without mincing matters it comes out with the advaitic truth, the whole truth and nothing but advaita which is the Truth. This book embodies Ashtavakra’s teaching to King Janaka which vouched him Self-Knowledge between the time he placed one foot upon the stirrup of his horse and lifted himself to place the other foot on the other stirrup.\n\nRadhakamal Mukerjee, an Indian social scientist, dated the book to the period immediately after the Hindu scripture Bhagavad Gita (c. 500–400 BC). \n\nMusic credits: Manose Suskera, Prem Ran Autari\n_______________________________________________\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________________\n\n🔆 If you would like to sponsor this channel and support the development of a small nun’s retreat hermitage:\n➤  PayPal: https://paypal.me/VivekaHermitage\n➤  Patreon: https://www.patreon.com/jayasara\n_______________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized (and never will be) and the videos are strictly for educational purposes, not-for-profit and non-commercial.\n “All the videos, songs, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2019-11-03 00:00:00",
    "duration_seconds": 2500,
    "view_count": 12705,
    "like_count": 262,
    "dislike_count": 0,
    "average_rating": 4.8248177,
    "files": {
      "video_filename": "Ashtavakra Gita - Part 4 - Ramana Maharshi - Advaita-NkleDncfsV0.webm",
      "info_filename": "Ashtavakra Gita - Part 4 - Ramana Maharshi - Advaita-NkleDncfsV0.info.json",
      "thumbnail_filename": "Ashtavakra Gita - Part 4 - Ramana Maharshi - Advaita-NkleDncfsV0.webp"
    }
  }
}