{
  "_id": "DdyEqGDVCEM",
  "as_of": "2021-12-12 06:27:17.218125",
  "video": {
    "title": "Padmasambhava - Pointers for Meditation - Songs to the 25 Disciples - Dzogchen",
    "description": "A sublime and powerful terma treasure teaching given by the Great Master to 25 renowned disciples. \nText taken from the text \"Advice from the Lotus Born\" translated by Erik Pema Kunsang.\nBook can be purchased here: https://www.amazon.com/Advice-Lotus-Born-Collection-Padmasambhavas-Disciples/dp/9627341207\n\nAbout Padmasambhava/Guru Rinpoche: \nHe first appears in Buddhist manuscripts in the early 7th century, described as being one of the most powerful Tantrics in Tibetan history, summoned to Tibet by the King Trisong Detsen to propagate the Buddhist religion in Tibet. It is him that built the Samye Monastery. He is revered in India, Tibet and Nepal as being the master of the Tantras, the fundamental texts in the Vajrayana tradition.\n\nMusic:  Vajra Guru Mantra for Meditation - Penpa Lama - Khawa Jong\nFree Flow Sky Meditation - Calm Whale\n_______________________________________________\n\n❤️ A deep thank you to all donors for your offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________________\n\n🔆 If you would like to sponsor this channel and support the development of a small nun’s retreat hermitage:\n➤  PayPal: https://paypal.me/VivekaHermitage\n➤  Patreon: https://www.patreon.com/jayasara\n_______________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized (and never will be) and the videos are strictly for educational purposes, not-for-profit and non-commercial.\n “All the videos, songs, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”\n\nAll Music, Pictures, Videos and Sounds That Appear In This Video Are Owned By Their Respective Owners. \n\"Copyright Disclaimer, Under Section 107 of the Copyright Act 1976, allowance is made for 'fair use' for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favour of fair use.\"",
    "tags": [
      "dzogchen",
      "padmasambhava",
      "tibetan buddhism",
      "guru rinpoche"
    ],
    "categories": [
      "People & Blogs"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2020-07-02 00:00:00",
    "duration_seconds": 3020,
    "view_count": 8599,
    "like_count": 268,
    "dislike_count": 0,
    "average_rating": 4.9124088,
    "files": {
      "video_filename": "Padmasambhava - Pointers for Meditation - Songs to the 25 Disciples - Dzogchen-DdyEqGDVCEM.webm",
      "info_filename": "Padmasambhava - Pointers for Meditation - Songs to the 25 Disciples - Dzogchen-DdyEqGDVCEM.info.json",
      "thumbnail_filename": "Padmasambhava - Pointers for Meditation - Songs to the 25 Disciples - Dzogchen-DdyEqGDVCEM.webp"
    }
  }
}