{
  "_id": "RiDPMZ-6rIA",
  "as_of": "2021-12-12 14:37:40.088568",
  "video": {
    "title": "Songs of Realization - Khenpo Tsültrim Gyamtso Rinpoche - Karma Kagyu - Tibetan Buddhism",
    "description": "Selected \"Songs of Realization\" by Khenpo Rinpoche  (all translated by Ari Goldfield).\n\nKhenpo Tsultrim Gyamtso Rinpoche is one of the foremost living teachers of the Kagyu tradition of Tibetan Buddhism, a great scholar and master of meditation.  He teaches widely in the West, often through songs of realization, his own as well as those composed by Milarepa and other masters of the past. \"Tsültrim Gyamtso\" translates to English as \"Ocean of Ethical Conduct\". Khenpo Rinpoche demonstrates the carefree life of a yogin, singing spontaneous songs of realisation wherever he goes, devoted only to the welfare of others.\n\nOriginal music by Maok - with deep thanks to Maok for collaborating on this special project.\nPlease find more of Maok's music at his following sites:\nhttps://www.maok.sk/eshop/store.php​​\nhttps://maokmusic.bandcamp.com/​​\n_________________________________________\n\n🙏 May whatever goodness arises from these readings/offerings be for the benefit of all sentient beings.\n\n❤️ A sincere thank you to all listeners and donors for your appreciative comments and offerings of generosity in support of this channel and its intention.\nEvery day I am deeply touched by your warm support and kind messages of gratitude.\n\nTurn on the '🔔' to get notifications for new releases! \n_______________________________________\n\n🔆 Thank you to everyone who has written to inquire about offering a donation to express appreciation for this channel. You are welcome to do so, and all offerings will go towards the development of a small retreat hermitage for nuns.\nThere are two options to donate using this email address: vivekahermitage@gmail.com  with PayPal,\nor using this link: https://www.paypal.com/paypalme/VivekaHermitage\nor become at Patron at: https://www.patreon.com/jayasara\n\nAlternatively, if you prefer to make a bank deposit (or use alternatives like Transferwise or Xoom) to Viveka Hermitage account, either internationally or domestically, please contact us on the above email address for account details.\n_________________________________________\n\n🎧 As a Buddhist nun, my intention with this channel is to offer these creative adaptations of spiritual teachings for the purpose of deepening spiritual understanding, contemplation, meditation, healing, devotion and relaxation for listeners. This channel is not monetized for profit through YouTube advertising revenue, and never will be. All the videos are strictly for educational purposes, not-for-profit and non-commercial. If ads appear on some videos it is because the music companies have the “right” to run ads for their profit if I have used copyrighted music.\n “All the words, music, images, and graphics used in the video belong to their respective owners and I or this channel does not claim any right over them. This video is posted for educational and spiritual purposes only.\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
    "tags": [],
    "categories": [
      "Education"
    ],
    "channel_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "channel_title": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader": "Samaneri Jayasāra - Wisdom of the Masters",
    "uploader_id": "UCz6X8QK9_JG49hJxnzAu-1w",
    "upload_date": "2021-04-27 00:00:00",
    "duration_seconds": 1600,
    "view_count": 8823,
    "like_count": 326,
    "dislike_count": 0,
    "average_rating": 4.9756098,
    "files": {
      "video_filename": "Songs of Realization - Khenpo Tsültrim Gyamtso Rinpoche - Karma Kagyu - Tibetan Buddhism-RiDPMZ-6rIA.webm",
      "info_filename": "Songs of Realization - Khenpo Tsültrim Gyamtso Rinpoche - Karma Kagyu - Tibetan Buddhism-RiDPMZ-6rIA.info.json",
      "thumbnail_filename": "Songs of Realization - Khenpo Tsültrim Gyamtso Rinpoche - Karma Kagyu - Tibetan Buddhism-RiDPMZ-6rIA.webp"
    }
  }
}